open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
/****************************************************************************
 * app/bk7258/bk7258_voice_runtime.c
 * SPDX-License-Identifier: Apache-2.0
 *
 * One AP owner for physical PTT, the authenticated companion and audio.
 ****************************************************************************/

#include <nuttx/config.h>
#include "bk7258_voice_runtime.h"
#ifdef CONFIG_BK7258_WIFI_VNET
#include <arch/chip/bk7258_wifi.h>
#endif
#include "bk7258_voice_button.h"
#ifdef CONFIG_BK7258_PRODUCT_KEYS
#include "bk7258_product_keys.h"
#endif
#if defined(CONFIG_BK7258_PRODUCT_KEYS) && defined(CONFIG_BK7258_PM_SOFT_OFF)
#include <arch/chip/bk7258_pm.h>
#ifdef CONFIG_BK7258_USBMODE
#include <arch/chip/bk7258_usbmode.h>
#endif
#include <unistd.h>
#define BKVOICE_RUNTIME_SOFT_OFF 1
#endif
#include "bk7258_voice_config.h"
#include "bk7258_voice_session.h"
#include "bk7258_voice_tls.h"
#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
#include "bk7258_voice_wake_session.h"
#endif
#ifdef CONFIG_BK7258_OTA_MANAGER
#include <arch/chip/bk7258_active_image.h>
#include <arch/chip/bk7258_ota_catalog.h>
#include <arch/chip/bk7258_ota_manager.h>
#endif
#if defined(CONFIG_BK7258_OTA_MANAGER) && \
    defined(CONFIG_BK7258_OTA_SOURCE_HTTP) && \
    defined(CONFIG_BK7258_OTA_RPMSG) && \
    defined(CONFIG_BK7258_VOICE_OTA_PERSISTENCE)
#include "bk7258_voice_ota_flow.h"
#include "bk7258_voice_ota_store.h"
#include "bk7258_control_ota_request.h"
#include "bk7258_voice_ota_admission.h"
#include "bk7258_voice_ota_cancel.h"
#include <arch/chip/bk7258_ota_rpmsg.h>
#include <arch/chip/bk7258_ota_source_http.h>
#define BKVOICE_RUNTIME_OTA 1
#endif
#ifdef CONFIG_BK7258_HEALTH_SERVICE
#include "bk7258_health_protocol.h"
#include "bk7258_health_service.h"
#endif
#ifdef CONFIG_BK7258_PROVISION_GATT
#include "bk7258_provision_owner.h"
#include "bk7258_provision_identity.h"
#include "bk7258_provision_network.h"
#include "bk7258_provision_storage.h"
#include "bk7258_provision_settings.h"
#endif

#include <errno.h>
#include <limits.h>
#include <poll.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "bk7258_cloud_runtime.h"
#ifdef CONFIG_BK7258_PREFERENCES
#include "bk7258_preferences.h"
#endif
#include <syslog.h>
#include <time.h>
#include <mbedtls/platform_util.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/rpmsg/rpmsg.h>
#include <nuttx/spinlock.h>

#define BKVOICE_RX_SLOTS 4u
#define BKVOICE_IO_MS 3000u
#define BKVOICE_CONNECT_MS 12000u
#define BKVOICE_RX_IDLE_MS 300000u
#define BKVOICE_UPLOAD_MS 30000u
#ifdef BKVOICE_RUNTIME_SOFT_OFF
#define BKVOICE_SOFT_OFF_STATUS_POLL_MS 1000u
#endif
#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
_Static_assert(sizeof(CONFIG_BK7258_VOICE_KWS_MODEL_PATH) > 1,
               "wake runtime requires a model path");
_Static_assert(sizeof(CONFIG_BK7258_VOICE_KWS_MODEL_SHA256) == 65,
               "wake runtime requires a 64-character SHA-256");
#endif
#ifdef BKVOICE_RUNTIME_OTA
#define BKVOICE_OTA_CATALOG_URL_BYTES 256u
#define BKVOICE_OTA_JOIN_MS 5000u
#define BKVOICE_OTA_TARGET_APPROVAL_MS 5000u
#define BKVOICE_OTA_RESTORE_RETRY_MS 1000u
#define BKVOICE_OTA_TRIAL_POLL_MS 1000u

enum bkvoice_control_ota_state_e
{
  BKVOICE_CONTROL_OTA_IDLE = 0,
  BKVOICE_CONTROL_OTA_QUEUED,
  BKVOICE_CONTROL_OTA_ACTIVE,
  BKVOICE_CONTROL_OTA_TERMINAL,
};
#endif

struct bkvoice_runtime_s
{
  struct bkvoice_config_s config;
  struct bkcloud_runtime_s *cloud;
  uint64_t control_refresh_ms;
#ifdef CONFIG_BK7258_PROVISION_GATT
  struct bkprov_identity_s identity;
  bool identity_pending;
  bool identity_bound;
  int identity_result;
  uint64_t provision_restore_ms;
  uint64_t configuration_restore_ms;
#endif
  struct bkvoice_tls_s tls;
  struct bkvoice_wss_s wss;
  struct bkvoice_session_s session;
  struct bkvoice_ptt_s *ptt;
  uint32_t boot_generation;
  sem_t *wake;
  struct rpmsg_endpoint button_endpoint;
  mutex_t endpoint_lock;
  spinlock_t button_lock;
  bool button_link;
  uint32_t button_epoch;
  uint32_t button_sequence;
  uint64_t button_received_ms;
  uint32_t button_pressed;
#ifdef CONFIG_BK7258_PRODUCT_KEYS
  struct bkvoice_product_keys_s product_keys;
#endif
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  volatile bool soft_off_pending;
  bool soft_off_accepted;
  bool soft_off_blockdev_held;
  int soft_off_failure;
  uint64_t soft_off_status_ms;
  volatile unsigned int soft_off_mutations;
#endif
  uint32_t owner_button_epoch;
  bool armed;
  bool pressed;
  uint32_t presses;
#ifdef CONFIG_BK7258_VOICE_HIL_TEST
  uint64_t test_until;
#endif
  int last_error;
  bool cleanup_pending;
  bool initialized;
  pthread_t receiver;
  sem_t receiver_done;
  bool receiver_joinable;
  volatile bool receiver_stop;
  struct bkvoice_gateway_frame_s rx[BKVOICE_RX_SLOTS];
  volatile uint32_t rx_head;
  volatile uint32_t rx_tail;
  uint8_t *upload;
  size_t upload_size;
  size_t uploaded;
  uint64_t upload_deadline;
  uint32_t status_connection_generation;
  uint32_t status_health_sequence;
#ifdef CONFIG_BK7258_OTA_MANAGER
  struct bk7258_mcuboot_version_s firmware_version;
  uint8_t firmware_root_sha256[BK7258_OTA_SHA256_SIZE];
  bool firmware_identity_valid;
#endif
#ifdef BKVOICE_RUNTIME_OTA
  pthread_t ota_worker;
  sem_t ota_done;
  sem_t ota_target_decision;
  uint32_t ota_request_sequence;
  uint8_t ota_manifest_sha256[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES];
  char ota_catalog_url[BKVOICE_OTA_CATALOG_URL_BYTES];
  int ota_result;
  uint8_t ota_report_phase;
  uint8_t ota_report_progress;
  volatile uint8_t ota_job_state;
  volatile bool ota_cancel_requested;
  volatile uint8_t ota_target_admission;
  bool ota_worker_joinable;
  bool ota_store_ready;
  bool ota_intent_present;
  bool ota_request_prepared;
  bool ota_target_valid;
  bool ota_target_commit_started;
  volatile int ota_target_admission_result;
  uint64_t ota_store_revision;
  uint64_t ota_restore_ms;
  uint64_t ota_trial_poll_ms;
  struct bkvoice_ota_intent_s ota_intent;
  struct bk7258_mcuboot_version_s ota_target_version;
  uint32_t ota_target_security_counter;
  struct bkcontrol_ota_request_s *ota_direct_request;
  struct bkcontrol_ota_status_s ota_direct_status;
  bool ota_direct;
  bool ota_direct_status_valid;
#endif
#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
  struct bkvoice_wake_session_s *wake_session;
  int wake_result;
  bool wake_attempted;
#endif
};

static struct bkvoice_runtime_s g_runtime =
{
  .endpoint_lock = NXMUTEX_INITIALIZER,
  .button_lock = SP_UNLOCKED,
};

static uint64_t bkvoice_now(void)
{
  return bkvoice_config_now_ms(NULL);
}

#ifdef BKVOICE_RUNTIME_SOFT_OFF
static int bkvoice_soft_off_progress(struct bkvoice_runtime_s *runtime);

static bool bkvoice_soft_off_pending(const struct bkvoice_runtime_s *runtime)
{
  return __atomic_load_n(&runtime->soft_off_pending, __ATOMIC_ACQUIRE);
}

#ifdef BKVOICE_RUNTIME_OTA
static bool bkvoice_soft_off_mutation_enter(struct bkvoice_runtime_s *runtime)
{
  if (bkvoice_soft_off_pending(runtime)) return false;
  __atomic_add_fetch(&runtime->soft_off_mutations, 1u, __ATOMIC_ACQ_REL);
  if (bkvoice_soft_off_pending(runtime))
    {
      __atomic_sub_fetch(&runtime->soft_off_mutations, 1u, __ATOMIC_RELEASE);
      return false;
    }
  return true;
}

