open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
static void bkvoice_soft_off_mutation_leave(struct bkvoice_runtime_s *runtime)
{
  __atomic_sub_fetch(&runtime->soft_off_mutations, 1u, __ATOMIC_RELEASE);
}
#endif

static int bkvoice_soft_off_admit(const struct bkvoice_runtime_s *runtime)
{
#ifdef BKVOICE_RUNTIME_OTA
  if (__atomic_load_n(&runtime->soft_off_mutations, __ATOMIC_ACQUIRE) != 0u)
    {
      return -EBUSY;
    }
  if (!runtime->ota_store_ready || runtime->ota_intent_present ||
      runtime->ota_direct_request != NULL || runtime->ota_worker_joinable ||
      runtime->ota_target_commit_started ||
      __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE) !=
        BKVOICE_OTA_JOB_EMPTY ||
      bkvoice_ota_target_admission_load(&runtime->ota_target_admission) !=
        BKVOICE_OTA_TARGET_IDLE)
    {
      return -EBUSY;
    }
#endif
#ifdef CONFIG_BK7258_OTA_MANAGER
  struct bk7258_ota_manager_status_s ota;
  int ret = bk7258_ota_manager_get_status(&ota);

  if (ret < 0)
    {
      return ret;
    }

  if (ota.state != BK7258_OTA_MANAGER_IDLE &&
      ota.state != BK7258_OTA_MANAGER_FAILED &&
      ota.state != BK7258_OTA_MANAGER_CANCELED)
    {
      return -EBUSY;
    }
#endif
#ifdef CONFIG_BK7258_PROVISION_GATT
  if (runtime->identity_pending || bkprov_owner_busy() ||
      bkprov_network_busy())
    {
      return -EBUSY;
    }
#endif
  return runtime->upload != NULL || runtime->cleanup_pending ? -EBUSY : 0;
}
#endif

#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
static bool bkvoice_wake_committed(const struct bkvoice_runtime_s *runtime)
{
  return runtime->cloud != NULL && runtime->config.initialized &&
         runtime->identity_bound && !runtime->identity_pending &&
         !bkprov_network_busy();
}

static int bkvoice_wake_prepare(struct bkvoice_runtime_s *runtime)
{
  const struct bkvoice_wake_session_config_s config =
  {
    .model_path = CONFIG_BK7258_VOICE_KWS_MODEL_PATH,
    .model_sha256_hex = CONFIG_BK7258_VOICE_KWS_MODEL_SHA256,
    .arena_bytes = CONFIG_BK7258_VOICE_KWS_ARENA_BYTES,
    .listener_stack_size = CONFIG_BK7258_VOICE_CAPTURE_STACKSIZE,
    .listener_join_timeout_ms = CONFIG_BK7258_VOICE_CAPTURE_JOIN_TIMEOUT_MS,
  };
  int ret;

  if (runtime->wake_session != NULL) return 0;
  if (runtime->wake_attempted) return runtime->wake_result;
  if (!bkvoice_wake_committed(runtime)) return -EAGAIN;
  ret = bkcloud_runtime_ready(runtime->cloud);
  if (ret <= 0) return ret < 0 ? ret : -EAGAIN;

  runtime->wake_attempted = true;
  ret = bkvoice_wake_session_open(&runtime->wake_session, &config,
                                  runtime->ptt, runtime->cloud,
                                  runtime->wake);
  runtime->wake_result = ret;
  if (ret < 0)
    {
      runtime->last_error = ret;
      syslog(LOG_WARNING, "BKVOICE WAKE unavailable=%d mic=0\n", ret);
    }
  return ret;
}

static int bkvoice_wake_close(struct bkvoice_runtime_s *runtime)
{
  int ret = bkvoice_wake_session_close(&runtime->wake_session);

  if (ret == 0)
    {
      runtime->wake_attempted = false;
      runtime->wake_result = 0;
    }
  return ret;
}
#endif

#ifdef CONFIG_BK7258_HEALTH_SERVICE
static uint8_t bkvoice_runtime_battery_state(uint32_t state)
{
  switch (state)
    {
      case BKHEALTH_BATTERY_UNKNOWN:
        return BKVOICE_COMPANION_BATTERY_STATE_UNKNOWN;
      case BKHEALTH_BATTERY_FAULT:
        return BKVOICE_COMPANION_BATTERY_STATE_FAULT;
      case BKHEALTH_BATTERY_IDLE:
        return BKVOICE_COMPANION_BATTERY_STATE_IDLE;
      case BKHEALTH_BATTERY_FULL:
        return BKVOICE_COMPANION_BATTERY_STATE_FULL;
      case BKHEALTH_BATTERY_CHARGING:
        return BKVOICE_COMPANION_BATTERY_STATE_CHARGING;
      case BKHEALTH_BATTERY_DISCHARGING:
        return BKVOICE_COMPANION_BATTERY_STATE_DISCHARGING;
      default:
        break;
    }
  return BKVOICE_COMPANION_BATTERY_UNKNOWN;
}

static uint8_t bkvoice_runtime_charging(uint8_t state)
{
  if (state == BKVOICE_COMPANION_BATTERY_STATE_CHARGING)
    {
      return 1;
    }

  if (state == BKVOICE_COMPANION_BATTERY_STATE_IDLE ||
      state == BKVOICE_COMPANION_BATTERY_STATE_FULL ||
      state == BKVOICE_COMPANION_BATTERY_STATE_DISCHARGING)
    {
      return 0;
    }

  return 2;
}
#endif

static int bkvoice_runtime_report_device_status(
  struct bkvoice_runtime_s *runtime)
{
  struct bkvoice_gateway_snapshot_s gateway;
  struct bkvoice_gateway_status_s status;
  uint32_t health_sequence = 0;

  if (!runtime->session.ready)
    {
      return 0;
    }

  memset(&gateway, 0, sizeof(gateway));
  bkvoice_gateway_snapshot(&runtime->session.gateway, &gateway);
  if (gateway.companion_state != BKVOICE_COMPANION_IDLE ||
      gateway.connection_generation == 0)
    {
      return 0;
    }

  memset(&status, 0, sizeof(status));
  status.battery_percent = BKVOICE_COMPANION_BATTERY_UNKNOWN;
  status.charging = 2;
  status.battery_state = BKVOICE_COMPANION_BATTERY_UNKNOWN;
  status.battery_voltage_mv = BKVOICE_COMPANION_BATTERY_MV_UNKNOWN;
  status.firmware_major = BKVOICE_COMPANION_FW_UNKNOWN;
  status.firmware_minor = BKVOICE_COMPANION_FW_UNKNOWN;
  status.firmware_revision = BKVOICE_COMPANION_FW_UNKNOWN;
  status.firmware_build = BKVOICE_COMPANION_FW_BUILD_UNKNOWN;

#ifdef CONFIG_BK7258_OTA_MANAGER
  if (runtime->firmware_identity_valid)
    {
      status.firmware_major = runtime->firmware_version.major;
      status.firmware_minor = runtime->firmware_version.minor;
      status.firmware_revision = runtime->firmware_version.revision;
      status.firmware_build = runtime->firmware_version.build;
      memcpy(status.firmware_root_sha256, runtime->firmware_root_sha256,
             sizeof(status.firmware_root_sha256));
      status.firmware_identity_valid = true;
    }
#endif

#ifdef CONFIG_BK7258_HEALTH_SERVICE
  {
    struct bk7258_health_service_snapshot_s health;

    if (bk7258_health_service_snapshot(&health) == 0)
      {
        health_sequence = health.sequence;
        if ((health.flags & BK7258_HEALTH_SNAPSHOT_BATTERY_STATE_VALID) != 0)
          {
            status.battery_state =
              bkvoice_runtime_battery_state(health.battery_state);
            status.charging =
              bkvoice_runtime_charging(status.battery_state);
          }

        if ((health.flags & BK7258_HEALTH_SNAPSHOT_BATTERY_VOLTAGE_VALID) != 0)
          {
            status.battery_voltage_mv = (uint32_t)health.battery_voltage_mv;
          }
      }
  }
#endif

  if (runtime->status_connection_generation ==
        gateway.connection_generation &&
      runtime->status_health_sequence == health_sequence)
    {
      return 0;
    }

  int ret = bkvoice_gateway_report_status(&runtime->session.gateway, &status);
  if (ret >= 0)
    {
      runtime->status_connection_generation = gateway.connection_generation;
      runtime->status_health_sequence = health_sequence;
    }

  return ret;
}

#ifdef BKVOICE_RUNTIME_OTA
struct bkvoice_ota_source_proxy_s
{
  struct bkvoice_runtime_s *runtime;
  const struct bk7258_ota_source_ops_s *source;
  void *context;
};

static bool bkvoice_ota_intent_equal(
  const struct bkvoice_ota_intent_s *left,
  const struct bkvoice_ota_intent_s *right)
{
  return left->state == right->state &&
         memcmp(left->manifest_sha256, right->manifest_sha256,
                sizeof(left->manifest_sha256)) == 0 &&
         bk7258_mcuboot_version_equal(&left->source_version,
                                      &right->source_version) &&
         left->source_security_counter == right->source_security_counter &&
         bk7258_mcuboot_version_equal(&left->target_version,
                                      &right->target_version) &&
         left->target_security_counter == right->target_security_counter &&
         left->source_boot_generation == right->source_boot_generation;
}

static bool bkvoice_ota_store_retryable(int error)
{
  return error == -EAGAIN || error == -EINPROGRESS ||
         error == -ENODEV || error == -ENOTCONN ||
         error == -ETIMEDOUT || error == -EXDEV;
}

