open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
static int bkvoice_ota_store_commit_runtime(
  struct bkvoice_runtime_s *runtime,
  const struct bkvoice_ota_intent_s *intent)
{
  struct bkvoice_ota_intent_s observed;
  uint64_t revision = 0;
  int ret = bkvoice_ota_store_commit(intent);

  if (ret == -EINPROGRESS)
    {
      (void)bkvoice_ota_store_reload();
      ret = bkvoice_ota_store_load(&observed, &revision);
      if (ret == 0 && bkvoice_ota_intent_equal(&observed, intent))
        {
          ret = 0;
        }
      else
        {
          return ret < 0 ? ret : -EAGAIN;
        }
    }

  if (ret == 0)
    {
      runtime->ota_intent = *intent;
      runtime->ota_intent_present = true;
    }

  return ret;
}

static int bkvoice_ota_store_clear_runtime(struct bkvoice_runtime_s *runtime)
{
  struct bkvoice_ota_intent_s observed;
  uint64_t revision = 0;
  int ret;

  if (!runtime->ota_intent_present)
    {
      return 0;
    }

  ret = bkvoice_ota_store_clear(runtime->ota_intent.manifest_sha256);
  if (ret == -EINPROGRESS)
    {
      (void)bkvoice_ota_store_reload();
      ret = bkvoice_ota_store_load(&observed, &revision);
      if (ret == -ENOENT)
        {
          ret = 0;
        }
      else
        {
          return ret < 0 ? ret : -EAGAIN;
        }
    }

  if (ret == 0 || ret == -ENOENT)
    {
      memset(&runtime->ota_intent, 0, sizeof(runtime->ota_intent));
      runtime->ota_intent_present = false;
      return 0;
    }

  return ret;
}

static void bkvoice_ota_restore_progress(struct bkvoice_runtime_s *runtime)
{
  uint64_t now;
  int ret;

  if (runtime->ota_store_ready)
    {
      return;
    }

  now = bkvoice_now();
  if (now < runtime->ota_restore_ms)
    {
      return;
    }

  runtime->ota_restore_ms = now + BKVOICE_OTA_RESTORE_RETRY_MS;
  ret = bkvoice_ota_store_load(&runtime->ota_intent,
                               &runtime->ota_store_revision);
  if (ret == 0)
    {
      runtime->ota_intent_present = true;
      runtime->ota_store_ready = true;
      return;
    }

  if (ret == -ENOENT)
    {
      memset(&runtime->ota_intent, 0, sizeof(runtime->ota_intent));
      runtime->ota_intent_present = false;
      runtime->ota_store_ready = true;
      return;
    }

  if (ret == -EINPROGRESS)
    {
      (void)bkvoice_ota_store_reload();
    }

  runtime->last_error = ret;
  if (!bkvoice_ota_store_retryable(ret))
    {
      syslog(LOG_ERR, "BKVOICE OTA intent_restore_fail=%d\n", ret);
    }
}

static int bkvoice_ota_source_open(
  void *context, struct bk7258_ota_manifest_s *manifest)
{
  struct bkvoice_ota_source_proxy_s *proxy = context;
  int ret = proxy->source->open(proxy->context, manifest);

  if (ret == 0)
    {
      struct timespec deadline;

      if (__atomic_load_n(&proxy->runtime->ota_cancel_requested,
                          __ATOMIC_ACQUIRE))
        {
          return -ECANCELED;
        }

      proxy->runtime->ota_target_version = manifest->image_version;
      proxy->runtime->ota_target_security_counter =
        manifest->security_counter;
      __atomic_store_n(&proxy->runtime->ota_target_admission_result,
                       -EINPROGRESS, __ATOMIC_RELAXED);
      bkvoice_ota_target_admission_publish(
        &proxy->runtime->ota_target_admission);
      (void)sem_post(proxy->runtime->wake);

      if (clock_gettime(CLOCK_REALTIME, &deadline) < 0)
        {
          return -errno;
        }

      deadline.tv_sec += BKVOICE_OTA_TARGET_APPROVAL_MS / 1000u;
      deadline.tv_nsec +=
        (long)(BKVOICE_OTA_TARGET_APPROVAL_MS % 1000u) * 1000l * 1000l;
      if (deadline.tv_nsec >= 1000l * 1000l * 1000l)
        {
          deadline.tv_sec++;
          deadline.tv_nsec -= 1000l * 1000l * 1000l;
        }

      for (;;)
        {
          uint8_t admission =
            bkvoice_ota_target_admission_load(
              &proxy->runtime->ota_target_admission);

          if (admission == BKVOICE_OTA_TARGET_APPROVED)
            {
              return 0;
            }

          if (admission == BKVOICE_OTA_TARGET_REJECTED)
            {
              return __atomic_load_n(
                       &proxy->runtime->ota_target_admission_result,
                       __ATOMIC_RELAXED);
            }

          if (admission == BKVOICE_OTA_TARGET_READY &&
              __atomic_load_n(&proxy->runtime->ota_cancel_requested,
                              __ATOMIC_ACQUIRE))
            {
              if (bkvoice_ota_target_admission_claim_rejection(
                    &proxy->runtime->ota_target_admission))
                {
                  __atomic_store_n(
                    &proxy->runtime->ota_target_admission_result,
                    -ECANCELED, __ATOMIC_RELAXED);
                  bkvoice_ota_target_admission_finish(
                    &proxy->runtime->ota_target_admission, false);
                  return -ECANCELED;
                }

              continue;
            }

          if (sem_timedwait(&proxy->runtime->ota_target_decision,
                            &deadline) == 0)
            {
              continue;
            }

          if (errno == EINTR)
            {
              continue;
            }

          ret = errno == ETIMEDOUT ? -ETIMEDOUT : -errno;
          return ret;
        }
    }

  return ret;
}

static int bkvoice_ota_source_read(
  void *context, enum bk7258_ota_image_e image, uint32_t offset,
  uint8_t *buffer, size_t nbytes)
{
  struct bkvoice_ota_source_proxy_s *proxy = context;
  return proxy->source->read_at(proxy->context, image, offset, buffer, nbytes);
}

static int bkvoice_ota_source_checkpoint(
  void *context, const struct bk7258_ota_progress_s *progress)
{
  struct bkvoice_ota_source_proxy_s *proxy = context;
  return proxy->source->checkpoint == NULL ? 0 :
         proxy->source->checkpoint(proxy->context, progress);
}

static int bkvoice_ota_source_cancel(void *context)
{
  struct bkvoice_ota_source_proxy_s *proxy = context;
  return proxy->source->cancel == NULL ? 0 :
         proxy->source->cancel(proxy->context);
}

static void bkvoice_ota_source_close(void *context)
{
  struct bkvoice_ota_source_proxy_s *proxy = context;
  if (proxy->source->close != NULL)
    {
      proxy->source->close(proxy->context);
    }
}

static const struct bk7258_ota_source_ops_s g_bkvoice_ota_source_ops =
{
  .open = bkvoice_ota_source_open,
  .read_at = bkvoice_ota_source_read,
  .checkpoint = bkvoice_ota_source_checkpoint,
  .cancel = bkvoice_ota_source_cancel,
  .close = bkvoice_ota_source_close,
};

static int bkvoice_ota_request(
  void *context, uint32_t request_sequence,
  const uint8_t manifest_sha256[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES])
{
  struct bkvoice_runtime_s *runtime = context;

  if (runtime == NULL || request_sequence == 0 || manifest_sha256 == NULL)
    {
      return -EINVAL;
    }

  if (!runtime->config.initialized && runtime->ota_direct_request == NULL)
    {
      return -ENOKEY;
    }

  if (!runtime->ota_store_ready)
    {
      return -EAGAIN;
    }

#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
  if (runtime->wake_session != NULL)
    {
      int ret = bkvoice_wake_session_step(runtime->wake_session, false,
                                          bkvoice_now());
      if (ret < 0) return ret;
    }
#endif

  if (__atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE) !=
      BKVOICE_OTA_JOB_EMPTY)
    {
      return -EBUSY;
    }

#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (!bkvoice_soft_off_mutation_enter(runtime)) return -ESHUTDOWN;
  if (__atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE) !=
      BKVOICE_OTA_JOB_EMPTY)
    {
      bkvoice_soft_off_mutation_leave(runtime);
      return -EBUSY;
    }
#endif

  runtime->ota_request_sequence = request_sequence;
  memcpy(runtime->ota_manifest_sha256, manifest_sha256,
         sizeof(runtime->ota_manifest_sha256));
  runtime->ota_report_phase = 0;
  runtime->ota_report_progress = 0;
  runtime->ota_result = -EINPROGRESS;
  runtime->ota_request_prepared = false;
  runtime->ota_target_valid = false;
  runtime->ota_target_commit_started = false;
  __atomic_store_n(&runtime->ota_target_admission_result, 0,
                   __ATOMIC_RELAXED);
  while (sem_trywait(&runtime->ota_target_decision) == 0)
    {
    }
  __atomic_store_n(&runtime->ota_target_admission, BKVOICE_OTA_TARGET_IDLE,
                   __ATOMIC_RELEASE);
  memset(&runtime->ota_target_version, 0,
         sizeof(runtime->ota_target_version));
  runtime->ota_target_security_counter = 0;
  __atomic_store_n(&runtime->ota_cancel_requested, false, __ATOMIC_RELEASE);
  __atomic_store_n(&runtime->ota_job_state, BKVOICE_OTA_JOB_QUEUED,
                   __ATOMIC_RELEASE);
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  bkvoice_soft_off_mutation_leave(runtime);
#endif
  (void)sem_post(runtime->wake);
  return 0;
}

static int bkvoice_ota_catalog_url(struct bkvoice_runtime_s *runtime)
{
  static const char hex[] = "0123456789abcdef";
  char digest[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES * 2u + 1u];
  int length;

