open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
  for (size_t index = 0; index < sizeof(runtime->ota_manifest_sha256); index++)
    {
      digest[index * 2u] = hex[runtime->ota_manifest_sha256[index] >> 4];
      digest[index * 2u + 1u] = hex[runtime->ota_manifest_sha256[index] & 15u];
    }

  digest[sizeof(digest) - 1u] = '\0';
  length = snprintf(runtime->ota_catalog_url,
                    sizeof(runtime->ota_catalog_url),
                    "https://%s:%u/firmware/v1/%s/catalog.json",
                    runtime->config.host, (unsigned int)runtime->config.port,
                    digest);
  return length < 0 || (size_t)length >= sizeof(runtime->ota_catalog_url) ?
         -ENAMETOOLONG : 0;
}

static void *bkvoice_ota_worker(void *context)
{
  struct bkvoice_runtime_s *runtime = context;
  struct bk7258_ota_http_source_s source = {0};
  struct bkvoice_ota_source_proxy_s proxy;
  const struct bk7258_ota_source_ops_s *ops = NULL;
  mbedtls_x509_crt direct_ca;
  struct in_addr direct_peer;
  bool direct_ca_initialized = false;
  int ret;

  if (__atomic_load_n(&runtime->ota_cancel_requested, __ATOMIC_ACQUIRE))
    {
      ret = -ECANCELED;
      goto out;
    }

  if (runtime->ota_direct_request != NULL)
    {
      mbedtls_x509_crt_init(&direct_ca);
      direct_ca_initialized = true;
      ret = mbedtls_x509_crt_parse(
              &direct_ca,
              (const unsigned char *)runtime->ota_direct_request->ca_pem,
              strlen(runtime->ota_direct_request->ca_pem) + 1u);
      if (ret != 0)
        {
          ret = -EKEYREJECTED;
          goto out;
        }

      memcpy(&direct_peer.s_addr, runtime->ota_direct_request->ipv4,
             sizeof(direct_peer.s_addr));
      ret = bk7258_ota_http_source_initialize_with_server_ca(
              &source, runtime->ota_catalog_url, &direct_peer, &direct_ca);
    }
  else
    {
      ret = bk7258_ota_http_source_initialize_with_credentials(
              &source, runtime->ota_catalog_url,
              &runtime->config.peer_address, &runtime->config.ca,
              &runtime->config.certificate, &runtime->config.private_key);
    }
  if (ret < 0)
    {
      goto out;
    }

  if (runtime->ota_direct_request != NULL)
    {
      ret = bk7258_ota_http_source_expect_catalog(
              &source, runtime->ota_direct_request->catalog_sha256);
      if (ret < 0)
        {
          goto close_source;
        }
    }

  ops = bk7258_ota_http_source_ops();
  proxy.runtime = runtime;
  proxy.source = ops;
  proxy.context = &source;
  if (__atomic_load_n(&runtime->ota_cancel_requested, __ATOMIC_ACQUIRE))
    {
      ret = -ECANCELED;
    }
  else
    {
      ret = bk7258_ota_manager_apply(
              &g_bkvoice_ota_source_ops, &proxy,
              CONFIG_BK7258_OTA_RPMSG_CONTROL_TIMEOUT_MS);
    }

  /* The manager normally closes every admitted source.  Keep this guard for
   * an initialization/configuration failure before the manager can admit it.
   */

close_source:
  if (source.priv != NULL)
    {
      if (ops == NULL)
        {
          ops = bk7258_ota_http_source_ops();
        }

      if (ops != NULL && ops->close != NULL)
        {
          ops->close(&source);
        }
    }

out:
  if (direct_ca_initialized)
    {
      mbedtls_x509_crt_free(&direct_ca);
    }

  runtime->ota_result = ret;
  __atomic_store_n(&runtime->ota_job_state, BKVOICE_OTA_JOB_DONE,
                   __ATOMIC_RELEASE);
  (void)sem_post(&runtime->ota_done);
  (void)sem_post(runtime->wake);
  return NULL;
}

static void bkvoice_ota_flush_done(struct bkvoice_runtime_s *runtime)
{
  while (sem_trywait(&runtime->ota_done) == 0)
    {
    }
}

static int bkvoice_ota_start(struct bkvoice_runtime_s *runtime)
{
  pthread_attr_t attr;
  int ret;

  if (__atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE) !=
      BKVOICE_OTA_JOB_QUEUED)
    {
      return 0;
    }

  if (runtime->ota_direct_request != NULL)
    {
      size_t length = strlen(runtime->ota_direct_request->url);
      if (length >= sizeof(runtime->ota_catalog_url))
        {
          ret = -ENAMETOOLONG;
        }
      else
        {
          memcpy(runtime->ota_catalog_url, runtime->ota_direct_request->url,
                 length + 1u);
          ret = 0;
        }
    }
  else
    {
      ret = bkvoice_ota_catalog_url(runtime);
    }
  if (ret < 0)
    {
      runtime->ota_result = ret;
      __atomic_store_n(&runtime->ota_job_state, BKVOICE_OTA_JOB_DONE,
                       __ATOMIC_RELEASE);
      return 0;
    }

  bkvoice_ota_flush_done(runtime);
  __atomic_store_n(&runtime->ota_job_state, BKVOICE_OTA_JOB_APPLYING,
                   __ATOMIC_RELEASE);
  ret = pthread_attr_init(&attr);
  if (ret == 0)
    {
      ret = pthread_attr_setstacksize(
              &attr, CONFIG_BK7258_OTA_RPMSG_AP_STACKSIZE);
      if (ret == 0)
        {
          ret = pthread_create(&runtime->ota_worker, &attr,
                               bkvoice_ota_worker, runtime);
        }

      (void)pthread_attr_destroy(&attr);
    }

  if (ret != 0)
    {
      runtime->ota_result = -ret;
      __atomic_store_n(&runtime->ota_job_state, BKVOICE_OTA_JOB_DONE,
                       __ATOMIC_RELEASE);
    }
  else
    {
      runtime->ota_worker_joinable = true;
    }

  return 0;
}

static int bkvoice_ota_join_finished(struct bkvoice_runtime_s *runtime)
{
  int ret;

  if (!runtime->ota_worker_joinable)
    {
      return 0;
    }

  ret = pthread_join(runtime->ota_worker, NULL);
  if (ret != 0)
    {
      return -ret;
    }

  runtime->ota_worker_joinable = false;
  return 0;
}

static void bkvoice_ota_clear(struct bkvoice_runtime_s *runtime)
{
  if (runtime->ota_direct_request != NULL &&
      !runtime->ota_worker_joinable)
    {
      mbedtls_platform_zeroize(runtime->ota_direct_request,
                               sizeof(*runtime->ota_direct_request));
      free(runtime->ota_direct_request);
      runtime->ota_direct_request = NULL;
    }

  runtime->ota_request_sequence = 0;
  memset(runtime->ota_manifest_sha256, 0,
         sizeof(runtime->ota_manifest_sha256));
  memset(runtime->ota_catalog_url, 0, sizeof(runtime->ota_catalog_url));
  runtime->ota_result = 0;
  runtime->ota_report_phase = 0;
  runtime->ota_report_progress = 0;
  runtime->ota_request_prepared = false;
  runtime->ota_target_valid = false;
  runtime->ota_target_commit_started = false;
  __atomic_store_n(&runtime->ota_target_admission_result, 0,
                   __ATOMIC_RELAXED);
  runtime->ota_trial_poll_ms = 0;
  memset(&runtime->ota_target_version, 0,
         sizeof(runtime->ota_target_version));
  runtime->ota_target_security_counter = 0;
  runtime->ota_direct = false;
  __atomic_store_n(&runtime->ota_cancel_requested, false, __ATOMIC_RELEASE);
  __atomic_store_n(&runtime->ota_target_admission,
                   BKVOICE_OTA_TARGET_IDLE, __ATOMIC_RELEASE);
  __atomic_store_n(&runtime->ota_job_state, BKVOICE_OTA_JOB_EMPTY,
                   __ATOMIC_RELEASE);
}

static void bkvoice_ota_reject_pending_target(
  struct bkvoice_runtime_s *runtime, int error)
{
  if (bkvoice_ota_target_admission_claim_rejection(
        &runtime->ota_target_admission))
    {
      __atomic_store_n(&runtime->ota_target_admission_result, error,
                       __ATOMIC_RELAXED);
      bkvoice_ota_target_admission_finish(
        &runtime->ota_target_admission, false);
      (void)sem_post(&runtime->ota_target_decision);
    }
}

static bool bkvoice_ota_commit_sensitive(
  const struct bkvoice_runtime_s *runtime)
{
  return bkvoice_ota_intent_is_commit_sensitive(
           runtime->ota_intent_present,
           runtime->ota_intent_present &&
             runtime->ota_intent.state == BKVOICE_OTA_DOWNLOADING,
           runtime->ota_intent_present ?
             runtime->ota_intent.target_security_counter : 0u,
           runtime->ota_target_commit_started);
}

static void bkvoice_ota_admit_pending_target(
  struct bkvoice_runtime_s *runtime)
{
  struct bkvoice_ota_intent_s intent;
  int ret;

  if (!bkvoice_ota_target_admission_claim(
        &runtime->ota_target_admission))
    {
      return;
    }

