open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
  if (!runtime->ota_intent_present ||
      runtime->ota_intent.state != BKVOICE_OTA_DOWNLOADING ||
      __atomic_load_n(&runtime->ota_cancel_requested, __ATOMIC_ACQUIRE))
    {
      ret = __atomic_load_n(&runtime->ota_cancel_requested,
                            __ATOMIC_ACQUIRE) ? -ECANCELED : -ESTALE;
    }
  else
    {
      intent = runtime->ota_intent;
      intent.target_version = runtime->ota_target_version;
      intent.target_security_counter = runtime->ota_target_security_counter;
      runtime->ota_target_commit_started = true;
      ret = bkvoice_ota_store_commit_runtime(runtime, &intent);
      if (ret == 0)
        {
          runtime->ota_target_valid = true;
        }
    }

  __atomic_store_n(&runtime->ota_target_admission_result, ret,
                   __ATOMIC_RELAXED);
  bkvoice_ota_target_admission_finish(&runtime->ota_target_admission,
                                      ret == 0);
  (void)sem_post(&runtime->ota_target_decision);
}

static int bkvoice_ota_cancel_join(struct bkvoice_runtime_s *runtime)
{
  uint8_t state = __atomic_load_n(&runtime->ota_job_state,
                                  __ATOMIC_ACQUIRE);
  int ret;

  if (state == BKVOICE_OTA_JOB_EMPTY)
    {
      return 0;
    }

  __atomic_store_n(&runtime->ota_cancel_requested, true, __ATOMIC_RELEASE);
  bkvoice_ota_reject_pending_target(runtime, -ECANCELED);
  if (runtime->ota_worker_joinable)
    {
      unsigned int attempts = BKVOICE_OTA_JOIN_MS / 50u;

      for (;;)
        {
          struct timespec deadline;

          (void)bk7258_ota_manager_cancel();
          if (clock_gettime(CLOCK_REALTIME, &deadline) < 0)
            {
              return -errno;
            }

          deadline.tv_nsec += 50l * 1000l * 1000l;
          if (deadline.tv_nsec >= 1000l * 1000l * 1000l)
            {
              deadline.tv_sec++;
              deadline.tv_nsec -= 1000l * 1000l * 1000l;
            }

          ret = sem_timedwait(&runtime->ota_done, &deadline);
          if (ret == 0)
            {
              break;
            }
          if (errno != ETIMEDOUT && errno != EINTR)
            {
              return -errno;
            }
          if (attempts-- == 0u)
            {
              return -ETIMEDOUT;
            }
        }

      ret = bkvoice_ota_join_finished(runtime);
      if (ret < 0)
        {
          (void)sem_post(&runtime->ota_done);
          return ret;
        }
    }

  bkvoice_ota_clear(runtime);
  return 0;
}

static int bkvoice_ota_cancel_control(struct bkvoice_runtime_s *runtime,
                                      int *terminal_result)
{
  enum bkvoice_ota_cancel_disposition_e disposition;
  uint8_t state;
  int manager_result = 0;
  int ret;

  if (terminal_result == NULL)
    {
      return -EINVAL;
    }

  *terminal_result = -ECANCELED;
  state = __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE);
  disposition = bkvoice_ota_cancel_disposition(
                  state, manager_result, runtime->ota_result,
                  runtime->ota_target_valid,
                  bkvoice_ota_commit_sensitive(runtime));
  if (!bkvoice_ota_cancel_requires_join(state,
                                        runtime->ota_worker_joinable) ||
      state != BKVOICE_OTA_JOB_DONE)
    {
      if (disposition == BKVOICE_OTA_CANCEL_PRESERVE)
        {
          return -EALREADY;
        }

      if (disposition == BKVOICE_OTA_CANCEL_CLEAR)
        {
          return 0;
        }
    }

  if (state == BKVOICE_OTA_JOB_APPLYING)
    {
      __atomic_store_n(&runtime->ota_cancel_requested, true,
                       __ATOMIC_RELEASE);
      bkvoice_ota_reject_pending_target(runtime, -ECANCELED);
      manager_result = bk7258_ota_manager_cancel();
      disposition = bkvoice_ota_cancel_disposition(
                      state, manager_result, runtime->ota_result,
                      runtime->ota_target_valid,
                      bkvoice_ota_commit_sensitive(runtime));
      if (disposition == BKVOICE_OTA_CANCEL_PRESERVE)
        {
          return manager_result;
        }
    }

  if (runtime->ota_worker_joinable)
    {
      unsigned int attempts = BKVOICE_OTA_JOIN_MS / 50u;

      for (;;)
        {
          struct timespec deadline;

          if (clock_gettime(CLOCK_REALTIME, &deadline) < 0)
            {
              return -errno;
            }

          deadline.tv_nsec += 50l * 1000l * 1000l;
          if (deadline.tv_nsec >= 1000l * 1000l * 1000l)
            {
              deadline.tv_sec++;
              deadline.tv_nsec -= 1000l * 1000l * 1000l;
            }

          ret = sem_timedwait(&runtime->ota_done, &deadline);
          if (ret == 0)
            {
              break;
            }

          if (errno != ETIMEDOUT && errno != EINTR)
            {
              return -errno;
            }

          if (attempts-- == 0u)
            {
              return -ETIMEDOUT;
            }
        }

      ret = bkvoice_ota_join_finished(runtime);
      if (ret < 0)
        {
          (void)sem_post(&runtime->ota_done);
          return ret;
        }
    }

  state = __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE);
  disposition = bkvoice_ota_cancel_disposition(
                  state, manager_result, runtime->ota_result,
                  runtime->ota_target_valid,
                  bkvoice_ota_commit_sensitive(runtime));
  if (disposition == BKVOICE_OTA_CANCEL_PRESERVE)
    {
      return -EALREADY;
    }

  if (disposition == BKVOICE_OTA_CANCEL_WAIT)
    {
      return -EINPROGRESS;
    }

  if (runtime->ota_result < 0 && runtime->ota_result != -ECANCELED)
    {
      *terminal_result = runtime->ota_result;
    }
  else if (runtime->ota_result >= 0 && !runtime->ota_target_valid)
    {
      *terminal_result = -EBADMSG;
    }

  return 0;
}

static int bkvoice_ota_report(struct bkvoice_runtime_s *runtime, int result,
                              enum bkvoice_companion_ota_phase_e phase,
                              uint8_t progress)
{
  int ret;

  if (runtime->ota_direct)
    {
      runtime->ota_direct_status.state =
        phase == BKVOICE_COMPANION_OTA_CONFIRMED ||
        phase == BKVOICE_COMPANION_OTA_ROLLED_BACK ||
        phase == BKVOICE_COMPANION_OTA_FAILED ?
        BKVOICE_CONTROL_OTA_TERMINAL : BKVOICE_CONTROL_OTA_ACTIVE;

      runtime->ota_direct_status.phase = (uint32_t)phase;
      if (phase == BKVOICE_COMPANION_OTA_FAILED ||
          phase == BKVOICE_COMPANION_OTA_ROLLED_BACK)
        {
          if (!runtime->ota_direct_status_valid ||
              runtime->ota_direct_status.progress > 99u)
            {
              runtime->ota_direct_status.progress = UINT32_MAX;
              runtime->ota_direct_status.total = UINT32_MAX;
            }
        }
      else
        {
          runtime->ota_direct_status.progress = progress;
          runtime->ota_direct_status.total = 100u;
        }

      runtime->ota_direct_status.result = result;
      runtime->ota_direct_status_valid = true;
      runtime->ota_report_phase = (uint8_t)phase;
      runtime->ota_report_progress = progress;
      return 0;
    }

  if (runtime->ota_report_phase == (uint8_t)phase &&
      runtime->ota_report_progress == progress)
    {
      return 0;
    }

  ret = bkvoice_gateway_report_ota(
          &runtime->session.gateway, runtime->ota_request_sequence,
          runtime->ota_manifest_sha256, result, phase, progress);
  if (ret >= 0)
    {
      runtime->ota_report_phase = (uint8_t)phase;
      runtime->ota_report_progress = progress;
    }

  return ret;
}

static uint8_t bkvoice_ota_progress(
  const struct bk7258_ota_manager_status_s *status)
{
  uint32_t first;
  uint32_t span;
  uint32_t progress;

  if (status->state == BK7258_OTA_MANAGER_STAGING_AP)
    {
      first = 1u;
      span = 46u;
    }
  else if (status->state == BK7258_OTA_MANAGER_STAGING_CP)
    {
      first = 48u;
      span = 46u;
    }
  else
    {
      return 1u;
    }

