open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
  progress = status->total == 0u ? first :
             first + (uint32_t)((uint64_t)status->completed * span /
                                status->total);
  return progress > 94u ? 94u : (uint8_t)progress;
}

static int bkvoice_ota_report_through(
  struct bkvoice_runtime_s *runtime,
  enum bkvoice_companion_ota_phase_e last)
{
  enum bkvoice_companion_ota_phase_e phase;
  int ret;

  phase = runtime->ota_report_phase == 0 ?
          BKVOICE_COMPANION_OTA_DOWNLOADING :
          (enum bkvoice_companion_ota_phase_e)runtime->ota_report_phase;
  for (; phase <= last; phase++)
    {
      ret = bkvoice_ota_report(runtime, 0, phase, 100);
      if (ret < 0)
        {
          return ret;
        }
    }

  return 0;
}

static int bkvoice_ota_fail(struct bkvoice_runtime_s *runtime, int error,
                            bool clear_intent)
{
  int ret = 0;

  if (clear_intent)
    {
      ret = bkvoice_ota_store_clear_runtime(runtime);
      if (ret < 0)
        {
          return ret;
        }
    }

  ret = bkvoice_ota_report(runtime, error,
                           BKVOICE_COMPANION_OTA_FAILED,
                           runtime->ota_report_progress);
  if (ret >= 0)
    {
      bkvoice_ota_clear(runtime);
    }

  return ret;
}

static int bkvoice_ota_begin_new(
  struct bkvoice_runtime_s *runtime,
  const struct bk7258_ota_pair_snapshot_s *pair)
{
  struct bkvoice_ota_intent_s intent;
  int ret;

  if (!runtime->firmware_identity_valid ||
      pair->state != BK7258_OTA_PAIR_CONFIRMED ||
      !pair->security_counter_present || pair->security_counter == 0u ||
      !bk7258_mcuboot_version_equal(&pair->version,
                                    &runtime->firmware_version))
    {
      return -ESTALE;
    }

  memset(&intent, 0, sizeof(intent));
  intent.state = BKVOICE_OTA_DOWNLOADING;
  memcpy(intent.manifest_sha256, runtime->ota_manifest_sha256,
         sizeof(intent.manifest_sha256));
  intent.source_version = pair->version;
  intent.source_security_counter = pair->security_counter;
  intent.source_boot_generation = runtime->boot_generation;
  ret = bkvoice_ota_store_commit_runtime(runtime, &intent);
  if (ret == 0)
    {
      runtime->ota_request_prepared = true;
    }

  return ret;
}

static int bkvoice_ota_finish_terminal(
  struct bkvoice_runtime_s *runtime,
  enum bkvoice_companion_ota_phase_e phase)
{
  int ret = bkvoice_ota_report_through(runtime, phase);

  if (ret < 0)
    {
      return ret;
    }

  ret = bkvoice_ota_store_clear_runtime(runtime);
  if (ret == 0)
    {
      bkvoice_ota_clear(runtime);
    }

  return ret;
}

static int bkvoice_ota_prepare_request(struct bkvoice_runtime_s *runtime)
{
  struct bk7258_ota_pair_snapshot_s pair;
  enum bkvoice_ota_flow_action_e action;
  bool same_manifest;
  int ret;

  if (runtime->ota_request_prepared ||
      __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE) !=
        BKVOICE_OTA_JOB_QUEUED)
    {
      return 0;
    }

  memset(&pair, 0, sizeof(pair));
  ret = bk7258_ota_rpmsg_pair_status(
          &pair, CONFIG_BK7258_OTA_RPMSG_CONTROL_TIMEOUT_MS);
  if (ret < 0)
    {
      return ret;
    }

  if (!runtime->ota_intent_present)
    {
      return bkvoice_ota_begin_new(runtime, &pair);
    }

  ret = bkvoice_ota_flow_decide(&runtime->ota_intent,
                                runtime->boot_generation, &pair, &action);
  if (ret < 0)
    {
      return ret;
    }

  same_manifest =
    memcmp(runtime->ota_intent.manifest_sha256,
           runtime->ota_manifest_sha256,
           sizeof(runtime->ota_manifest_sha256)) == 0;
  if (!same_manifest)
    {
      if (action != BKVOICE_OTA_FLOW_CONFIRMED &&
          action != BKVOICE_OTA_FLOW_ROLLED_BACK)
        {
          return -EBUSY;
        }

      ret = bkvoice_ota_store_clear_runtime(runtime);
      return ret < 0 ? ret : bkvoice_ota_begin_new(runtime, &pair);
    }

  switch (action)
    {
      case BKVOICE_OTA_FLOW_RESTAGE:
        runtime->ota_request_prepared = true;
        return 0;

      case BKVOICE_OTA_FLOW_REBOOT:
        __atomic_store_n(&runtime->ota_job_state, BKVOICE_OTA_JOB_STAGED,
                         __ATOMIC_RELEASE);
        return 0;

      case BKVOICE_OTA_FLOW_TRIAL:
        if (runtime->ota_intent.state != BKVOICE_OTA_TRIAL)
          {
            struct bkvoice_ota_intent_s intent = runtime->ota_intent;
            intent.state = BKVOICE_OTA_TRIAL;
            ret = bkvoice_ota_store_commit_runtime(runtime, &intent);
            if (ret < 0)
              {
                return ret;
              }
          }

        ret = bkvoice_ota_report_through(runtime,
                                         BKVOICE_COMPANION_OTA_TRIAL);
        if (ret == 0)
          {
            runtime->ota_trial_poll_ms = 0;
            __atomic_store_n(&runtime->ota_job_state,
                             BKVOICE_OTA_JOB_TRIAL, __ATOMIC_RELEASE);
          }
        return ret;

      case BKVOICE_OTA_FLOW_CONFIRMED:
        return bkvoice_ota_finish_terminal(
                 runtime, BKVOICE_COMPANION_OTA_CONFIRMED);

      case BKVOICE_OTA_FLOW_ROLLED_BACK:
        return bkvoice_ota_finish_terminal(
                 runtime, BKVOICE_COMPANION_OTA_ROLLED_BACK);
    }

  return -EINVAL;
}

static int bkvoice_ota_reboot_step(struct bkvoice_runtime_s *runtime)
{
  struct bkvoice_ota_intent_s intent;
  int ret;

  ret = bkvoice_ota_report_through(runtime, BKVOICE_COMPANION_OTA_STAGED);
  if (ret < 0)
    {
      return ret;
    }

  if (runtime->ota_intent.state != BKVOICE_OTA_REBOOTING)
    {
      intent = runtime->ota_intent;
      intent.state = BKVOICE_OTA_REBOOTING;
      ret = bkvoice_ota_store_commit_runtime(runtime, &intent);
      if (ret < 0)
        {
          return ret;
        }
    }

  ret = bkvoice_ota_report(runtime, 0,
                           BKVOICE_COMPANION_OTA_REBOOTING, 100);
  if (ret < 0)
    {
      return ret;
    }

  __atomic_store_n(&runtime->ota_job_state, BKVOICE_OTA_JOB_REBOOTING,
                   __ATOMIC_RELEASE);
  return bk7258_ota_rpmsg_reboot(
           CONFIG_BK7258_OTA_RPMSG_CONTROL_TIMEOUT_MS);
}

