open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
static int bkvoice_ota_trial_step(struct bkvoice_runtime_s *runtime)
{
  struct bk7258_ota_pair_snapshot_s pair;
  enum bkvoice_ota_flow_action_e action;
  uint64_t now = bkvoice_now();
  int ret;

  if (now < runtime->ota_trial_poll_ms)
    {
      return 0;
    }

  runtime->ota_trial_poll_ms = now + BKVOICE_OTA_TRIAL_POLL_MS;
  memset(&pair, 0, sizeof(pair));
  ret = bk7258_ota_rpmsg_pair_status(
          &pair, CONFIG_BK7258_OTA_RPMSG_CONTROL_TIMEOUT_MS);
  if (ret < 0)
    {
      return ret;
    }

  ret = bkvoice_ota_flow_decide(&runtime->ota_intent,
                                runtime->boot_generation, &pair, &action);
  if (ret < 0)
    {
      return ret;
    }

  if (action == BKVOICE_OTA_FLOW_TRIAL)
    {
      return bkvoice_ota_report_through(runtime,
                                        BKVOICE_COMPANION_OTA_TRIAL);
    }

  if (action == BKVOICE_OTA_FLOW_CONFIRMED)
    {
      return bkvoice_ota_finish_terminal(
               runtime, BKVOICE_COMPANION_OTA_CONFIRMED);
    }

  if (action == BKVOICE_OTA_FLOW_ROLLED_BACK)
    {
      return bkvoice_ota_finish_terminal(
               runtime, BKVOICE_COMPANION_OTA_ROLLED_BACK);
    }

  return -ESTALE;
}

static int bkvoice_ota_step(struct bkvoice_runtime_s *runtime)
{
  struct bk7258_ota_manager_status_s status;
  struct bkvoice_ota_intent_s intent;
  uint8_t state;
  int ret;

  state = __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE);
  if (state == BKVOICE_OTA_JOB_QUEUED && !runtime->ota_request_prepared)
    {
      ret = bkvoice_ota_prepare_request(runtime);
      if (ret < 0)
        {
          return bkvoice_ota_store_retryable(ret) ? ret :
                 bkvoice_ota_fail(runtime, ret, false);
        }
    }

  state = __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE);
  if (state == BKVOICE_OTA_JOB_STAGED)
    {
      return bkvoice_ota_reboot_step(runtime);
    }

  if (state == BKVOICE_OTA_JOB_TRIAL)
    {
      return bkvoice_ota_trial_step(runtime);
    }

  if (state == BKVOICE_OTA_JOB_REBOOTING)
    {
      return 0;
    }

  ret = bkvoice_ota_start(runtime);
  if (ret < 0)
    {
      return ret;
    }

  state = __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE);
  if (state == BKVOICE_OTA_JOB_APPLYING &&
      bkvoice_ota_target_admission_load(
        &runtime->ota_target_admission) == BKVOICE_OTA_TARGET_READY)
    {
      bkvoice_ota_admit_pending_target(runtime);
    }

  if (state == BKVOICE_OTA_JOB_APPLYING &&
      bk7258_ota_manager_get_status(&status) == 0)
    {
      if (status.state == BK7258_OTA_MANAGER_STAGING_AP ||
          status.state == BK7258_OTA_MANAGER_STAGING_CP ||
          status.state == BK7258_OTA_MANAGER_PACKAGE_VERIFIED)
        {
          uint8_t progress = bkvoice_ota_progress(&status);
          if (progress < runtime->ota_report_progress)
            {
              progress = runtime->ota_report_progress;
            }

          ret = bkvoice_ota_report(runtime, 0,
                                   BKVOICE_COMPANION_OTA_DOWNLOADING,
                                   progress);
          if (ret < 0)
            {
              return ret;
            }
        }
      else if (status.state == BK7258_OTA_MANAGER_PAIR_VERIFIED)
        {
          ret = bkvoice_ota_report(runtime, 0,
                                   BKVOICE_COMPANION_OTA_VERIFYING, 100);
          if (ret < 0)
            {
              return ret;
            }
        }
    }

  state = __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE);
  if (state != BKVOICE_OTA_JOB_DONE)
    {
      return 0;
    }

  ret = bkvoice_ota_join_finished(runtime);
  if (ret < 0)
    {
      return ret;
    }

  if (runtime->ota_result < 0)
    {
      return bkvoice_ota_fail(runtime, runtime->ota_result,
                              !bkvoice_ota_commit_sensitive(runtime));
    }

  if (!runtime->ota_target_valid)
    {
      return bkvoice_ota_fail(runtime, -EBADMSG, false);
    }

  intent = runtime->ota_intent;
  intent.target_version = runtime->ota_target_version;
  intent.target_security_counter = runtime->ota_target_security_counter;
  intent.state = BKVOICE_OTA_STAGED;
  ret = bkvoice_ota_store_commit_runtime(runtime, &intent);
  if (ret < 0)
    {
      return bkvoice_ota_fail(runtime, ret, false);
    }

  ret = bkvoice_ota_report_through(runtime, BKVOICE_COMPANION_OTA_STAGED);
  if (ret < 0)
    {
      return ret;
    }

  __atomic_store_n(&runtime->ota_job_state, BKVOICE_OTA_JOB_STAGED,
                   __ATOMIC_RELEASE);
  return 0;
}

static void bkvoice_ota_status_unknown(struct bkcontrol_ota_status_s *status)
{
  memset(status, 0xff, sizeof(*status));
  status->state = BKVOICE_CONTROL_OTA_IDLE;
  status->result = 0;
}

static void bkvoice_ota_status_from_manager(
  struct bkvoice_runtime_s *runtime,
  const struct bk7258_ota_manager_status_s *manager,
  struct bkcontrol_ota_status_s *status)
{
  uint8_t progress;

  status->state = BKVOICE_CONTROL_OTA_ACTIVE;
  status->phase = BKVOICE_COMPANION_OTA_DOWNLOADING;
  status->progress = 0u;
  status->total = 100u;
  status->result = manager->last_error;

  switch (manager->state)
    {
      case BK7258_OTA_MANAGER_STAGING_AP:
      case BK7258_OTA_MANAGER_STAGING_CP:
      case BK7258_OTA_MANAGER_PACKAGE_VERIFIED:
        progress = bkvoice_ota_progress(manager);
        if (progress < runtime->ota_report_progress)
          {
            progress = runtime->ota_report_progress;
          }

        status->progress = progress;
        break;

      case BK7258_OTA_MANAGER_PAIR_VERIFIED:
        status->phase = BKVOICE_COMPANION_OTA_VERIFYING;
        status->progress = 100u;
        break;

      case BK7258_OTA_MANAGER_READY_TO_REBOOT:
        status->phase = BKVOICE_COMPANION_OTA_STAGED;
        status->progress = 100u;
        break;

      case BK7258_OTA_MANAGER_FAILED:
      case BK7258_OTA_MANAGER_CANCELED:
        status->state = BKVOICE_CONTROL_OTA_TERMINAL;
        status->phase = BKVOICE_COMPANION_OTA_FAILED;
        if (runtime->ota_direct_status_valid &&
            runtime->ota_direct_status.progress <= 99u)
          {
            status->progress = runtime->ota_direct_status.progress;
          }
        else
          {
            status->progress = UINT32_MAX;
            status->total = UINT32_MAX;
          }

        if (manager->state == BK7258_OTA_MANAGER_CANCELED &&
            status->result == 0)
          {
            status->result = -ECANCELED;
          }
        break;

      case BK7258_OTA_MANAGER_IDLE:
      case BK7258_OTA_MANAGER_CHECKING:
      default:
        break;
    }
}

static int bkvoice_ota_control_status(struct bkvoice_runtime_s *runtime,
                                      struct bkcontrol_ota_status_s *status)
{
  struct bk7258_ota_manager_status_s manager;
  uint8_t state;

  bkvoice_ota_status_unknown(status);
  state = __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE);
  if (runtime->ota_direct &&
      (state == BKVOICE_OTA_JOB_APPLYING ||
       state == BKVOICE_OTA_JOB_DONE) &&
      bk7258_ota_manager_get_status(&manager) == 0)
    {
      bkvoice_ota_status_from_manager(runtime, &manager, status);
      runtime->ota_direct_status = *status;
      runtime->ota_direct_status_valid = true;
      return 0;
    }

