open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
  if (runtime->ota_direct_status_valid)
    {
      *status = runtime->ota_direct_status;
      return 0;
    }

  if (runtime->ota_intent_present)
    {
      struct bk7258_ota_pair_snapshot_s pair;
      enum bkvoice_ota_flow_action_e action;
      int ret;

      memset(&pair, 0, sizeof(pair));
      ret = bk7258_ota_rpmsg_pair_status(
              &pair, CONFIG_BK7258_OTA_RPMSG_CONTROL_TIMEOUT_MS);
      if (ret < 0)
        {
          return ret;
        }

      ret = bkvoice_ota_flow_decide(&runtime->ota_intent,
                                    runtime->boot_generation, &pair,
                                    &action);
      if (ret < 0)
        {
          return ret;
        }

      status->result = action == BKVOICE_OTA_FLOW_CONFIRMED ||
                       action == BKVOICE_OTA_FLOW_ROLLED_BACK ?
                       0 : -EINPROGRESS;
      switch (action)
        {
          case BKVOICE_OTA_FLOW_RESTAGE:
            status->state = BKVOICE_CONTROL_OTA_ACTIVE;
            status->phase = BKVOICE_COMPANION_OTA_DOWNLOADING;
            break;
          case BKVOICE_OTA_FLOW_REBOOT:
            status->state = BKVOICE_CONTROL_OTA_ACTIVE;
            status->phase = BKVOICE_COMPANION_OTA_STAGED;
            status->progress = status->total = 100u;
            break;
          case BKVOICE_OTA_FLOW_TRIAL:
            status->state = BKVOICE_CONTROL_OTA_ACTIVE;
            status->phase = BKVOICE_COMPANION_OTA_TRIAL;
            status->progress = status->total = 100u;
            break;
          case BKVOICE_OTA_FLOW_CONFIRMED:
            status->state = BKVOICE_CONTROL_OTA_TERMINAL;
            status->phase = BKVOICE_COMPANION_OTA_CONFIRMED;
            status->progress = status->total = 100u;
            break;
          case BKVOICE_OTA_FLOW_ROLLED_BACK:
            status->state = BKVOICE_CONTROL_OTA_TERMINAL;
            status->phase = BKVOICE_COMPANION_OTA_ROLLED_BACK;
            break;
        }
    }

  return 0;
}
#endif

static void bkvoice_upload_clear(struct bkvoice_runtime_s *runtime)
{
  if (runtime->upload != NULL)
    {
      mbedtls_platform_zeroize(runtime->upload, runtime->upload_size);
      free(runtime->upload);
    }

  runtime->upload = NULL;
  runtime->upload_size = 0;
  runtime->uploaded = 0;
  runtime->upload_deadline = 0;
}

static void bkvoice_button_invalid(struct bkvoice_runtime_s *runtime)
{
  irqstate_t flags = spin_lock_irqsave(&runtime->button_lock);
  runtime->button_link = false;
  runtime->button_sequence = 0;
  runtime->button_received_ms = 0;
  runtime->button_pressed = false;
  runtime->button_epoch++;
  spin_unlock_irqrestore(&runtime->button_lock, flags);
  (void)sem_post(runtime->wake);
}

static int bkvoice_button_receive(struct rpmsg_endpoint *endpoint,
                                  void *data, size_t size, uint32_t src,
                                  void *priv)
{
  struct bkvoice_runtime_s *runtime = priv;
  struct bkvoice_button_event_s event;
  uint64_t now = bkvoice_now();
  irqstate_t flags;

  (void)endpoint;
  (void)src;
  if (data == NULL || size != sizeof(event))
    {
      return -EINVAL;
    }

  memcpy(&event, data, sizeof(event));
  if (event.magic != BKVOICE_BUTTON_MAGIC ||
      event.version != BKVOICE_BUTTON_VERSION || event.sequence == 0 ||
      event.reserved[0] != 0 || event.reserved[1] != 0)
    {
      return -EINVAL;
    }

#ifdef CONFIG_BK7258_PRODUCT_KEYS
  if ((event.pressed & ~BKVOICE_PRODUCT_KEY_VALID) != 0)
    {
      return -EINVAL;
    }
#else
  if (event.pressed > 1)
    {
      return -EINVAL;
    }
#endif

  flags = spin_lock_irqsave(&runtime->button_lock);
  if (event.sequence <= runtime->button_sequence)
    {
      spin_unlock_irqrestore(&runtime->button_lock, flags);
      return -ESTALE;
    }

  runtime->button_link = true;
  runtime->button_sequence = event.sequence;
  runtime->button_received_ms = now;
  runtime->button_pressed = event.pressed;
  spin_unlock_irqrestore(&runtime->button_lock, flags);
  (void)sem_post(runtime->wake);
  return 0;
}

#ifdef CONFIG_BK7258_PRODUCT_KEYS
static void bkvoice_runtime_product_keys(struct bkvoice_runtime_s *runtime,
                                         bool command_link, uint64_t now)
{
  uint32_t mask;
  uint32_t epoch;
  uint32_t action;
  bool link;
  bool power_requested;
  irqstate_t flags;
  int ret;

  flags = spin_lock_irqsave(&runtime->button_lock);
  link = command_link && runtime->button_link && runtime->button_sequence != 0 &&
         now >= runtime->button_received_ms &&
         now - runtime->button_received_ms < BKVOICE_BUTTON_LEASE_MS;
  epoch = runtime->button_epoch;
  mask = runtime->button_pressed;
  spin_unlock_irqrestore(&runtime->button_lock, flags);

  if (!link)
    {
      /* A stale lease is equivalent to a reconnect: require release before
       * any later held key can create an edge. */
      bkvoice_product_keys_reset(&runtime->product_keys, epoch);
      return;
    }

  action = bkvoice_product_keys_step(&runtime->product_keys, epoch, mask, now,
                                     &power_requested);
  if (power_requested)
    {
#ifdef BKVOICE_RUNTIME_SOFT_OFF
      bool expected = false;

      if (!__atomic_compare_exchange_n(&runtime->soft_off_pending, &expected,
                                       true, false, __ATOMIC_ACQ_REL,
                                       __ATOMIC_ACQUIRE))
        {
          return;
        }
      else
        {
          ret = bkvoice_soft_off_admit(runtime);
#ifdef CONFIG_BK7258_USBMODE
          if (ret == 0)
            {
              ret = bk7258_usbmode_blockdev_acquire();
              if (ret == 0) runtime->soft_off_blockdev_held = true;
            }
#endif
        }

      if (ret == 0)
        {
          runtime->soft_off_accepted = false;
          runtime->soft_off_failure = 0;
          (void)sem_post(runtime->wake);
          syslog(LOG_NOTICE, "BKVOICE KEYS soft_off_pending=1\n");
        }
      else
        {
          __atomic_store_n(&runtime->soft_off_pending, false,
                           __ATOMIC_RELEASE);
          runtime->last_error = ret;
          syslog(LOG_WARNING, "BKVOICE KEYS soft_off_rejected=%d\n", ret);
        }
#else
      runtime->last_error = -ENOTSUP;
      syslog(LOG_WARNING, "BKVOICE KEYS power_off_unsupported=%d\n",
             -ENOTSUP);
#endif
    }

