open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
  /* One press produces one rising edge. Repeated heartbeat masks have no
   * action, and an electrically impossible simultaneous +/- press is ignored.
   */
  if ((action & (BKVOICE_PRODUCT_KEY_VOLUME_DOWN |
                 BKVOICE_PRODUCT_KEY_VOLUME_UP)) ==
      BKVOICE_PRODUCT_KEY_VOLUME_DOWN ||
      (action & (BKVOICE_PRODUCT_KEY_VOLUME_DOWN |
                 BKVOICE_PRODUCT_KEY_VOLUME_UP)) ==
      BKVOICE_PRODUCT_KEY_VOLUME_UP)
    {
#ifdef CONFIG_BK7258_PREFERENCES
      unsigned int volume;
      int delta = (action & BKVOICE_PRODUCT_KEY_VOLUME_UP) != 0 ? 5 : -5;

      ret = bk7258_preferences_playback_volume(&volume);
      if (ret == 0)
        {
          if (delta < 0)
            {
              volume = volume < 5u ? 0u : volume - 5u;
            }
          else
            {
              volume = volume > 95u ? 100u : volume + 5u;
            }

          ret = bk7258_preferences_set_volume(volume);
        }

      if (ret < 0)
        {
          runtime->last_error = ret;
          syslog(LOG_WARNING, "BKVOICE KEYS volume_fail=%d\n", ret);
        }
#else
      runtime->last_error = -ENOTSUP;
      syslog(LOG_WARNING, "BKVOICE KEYS volume_unsupported=%d\n", -ENOTSUP);
#endif
    }
}
#endif

static void bkvoice_button_unbind(struct rpmsg_endpoint *endpoint)
{
  bkvoice_button_invalid(endpoint->priv);
}

static void bkvoice_button_device_created(struct rpmsg_device *rdev,
                                          void *priv)
{
  struct bkvoice_runtime_s *runtime = priv;
  const char *cpu = rpmsg_get_cpuname(rdev);

  if (cpu == NULL || strcmp(cpu, "cp") != 0)
    {
      return;
    }

  if (nxmutex_lock(&runtime->endpoint_lock) >= 0)
    {
      if (runtime->button_endpoint.rdev == NULL)
        {
          runtime->button_endpoint.priv = runtime;
          (void)rpmsg_create_ept(&runtime->button_endpoint, rdev,
                                 BKVOICE_BUTTON_ENDPOINT, RPMSG_ADDR_ANY,
                                 RPMSG_ADDR_ANY, bkvoice_button_receive,
                                 bkvoice_button_unbind);
        }

      nxmutex_unlock(&runtime->endpoint_lock);
    }
}

static void bkvoice_button_device_destroyed(struct rpmsg_device *rdev,
                                            void *priv)
{
  struct bkvoice_runtime_s *runtime = priv;

  if (nxmutex_lock(&runtime->endpoint_lock) >= 0)
    {
      if (runtime->button_endpoint.rdev == rdev)
        {
          bkvoice_button_invalid(runtime);
          rpmsg_destroy_ept(&runtime->button_endpoint);
          memset(&runtime->button_endpoint, 0,
                 sizeof(runtime->button_endpoint));
        }

      nxmutex_unlock(&runtime->endpoint_lock);
    }
}

static void *bkvoice_receiver(void *arg)
{
  struct bkvoice_runtime_s *runtime = arg;

  while (!__atomic_load_n(&runtime->receiver_stop, __ATOMIC_ACQUIRE))
    {
      uint32_t head = __atomic_load_n(&runtime->rx_head, __ATOMIC_RELAXED);
      uint32_t tail = __atomic_load_n(&runtime->rx_tail, __ATOMIC_ACQUIRE);
      struct bkvoice_gateway_frame_s *frame;
      int ret;

      if (head - tail >= BKVOICE_RX_SLOTS)
        {
          (void)poll(NULL, 0, 10);
          continue;
        }

      frame = &runtime->rx[head % BKVOICE_RX_SLOTS];
      ret = bkvoice_gateway_receive_frame(&runtime->session.gateway, frame,
                                          bkvoice_now() + BKVOICE_RX_IDLE_MS);
      if (ret < 0 && frame->generation == 0)
        {
          /* Initialization/lock failures precede the normal envelope stamp.
           * The owner cannot replace this connection before joining RX.
           */

          frame->generation = runtime->session.gateway.connection_generation;
          frame->error = ret;
        }
      __atomic_store_n(&runtime->rx_head, head + 1u, __ATOMIC_RELEASE);
      (void)sem_post(runtime->wake);
      if (ret < 0)
        {
          break;
        }
    }

  (void)sem_post(&runtime->receiver_done);
  return NULL;
}

static int bkvoice_runtime_disconnect(struct bkvoice_runtime_s *runtime,
                                      int reason)
{
  struct timespec deadline;
  int ret;

  runtime->armed = false;
  runtime->pressed = false;
  runtime->cleanup_pending = true;
#ifdef BKVOICE_RUNTIME_OTA
  ret = bkvoice_ota_cancel_join(runtime);
  if (ret < 0)
    {
      runtime->last_error = ret;
      return ret;
    }
#endif
#ifdef CONFIG_BK7258_VOICE_HIL_TEST
  runtime->test_until = 0;
#endif
  if (!runtime->session.initialized)
    {
      runtime->cleanup_pending = false;
      return 0;
    }

  __atomic_store_n(&runtime->receiver_stop, true, __ATOMIC_RELEASE);
  (void)bkvoice_session_interrupt(&runtime->session);
  if (runtime->receiver_joinable)
    {
      if (clock_gettime(CLOCK_REALTIME, &deadline) < 0)
        {
          return -errno;
        }

      deadline.tv_sec++;
      do
        {
          ret = sem_timedwait(&runtime->receiver_done, &deadline);
        }
      while (ret < 0 && errno == EINTR);

      if (ret < 0)
        {
          return -errno;
        }

      ret = pthread_join(runtime->receiver, NULL);
      if (ret != 0)
        {
          (void)sem_post(&runtime->receiver_done);
          return -ret;
        }

      runtime->receiver_joinable = false;
      __atomic_store_n(&runtime->rx_head, 0, __ATOMIC_RELEASE);
      __atomic_store_n(&runtime->rx_tail, 0, __ATOMIC_RELEASE);
    }

  ret = bkvoice_session_disconnect(&runtime->session, reason);
  if (ret < 0)
    {
      runtime->last_error = ret;
    }

  else
    {
      runtime->cleanup_pending = false;
    }

  return ret;
}

#ifdef BKVOICE_RUNTIME_SOFT_OFF
static int bkvoice_soft_off_fail(struct bkvoice_runtime_s *runtime, int error)
{
  if (runtime->soft_off_failure == 0) runtime->soft_off_failure = error;
#ifdef CONFIG_BK7258_USBMODE
  if (runtime->soft_off_blockdev_held)
    {
      int release_ret = bk7258_usbmode_blockdev_release();
      if (release_ret < 0)
        {
          runtime->soft_off_accepted = false;
          runtime->last_error = release_ret;
          return release_ret;
        }
      runtime->soft_off_blockdev_held = false;
    }
#endif
  error = runtime->soft_off_failure;
  runtime->soft_off_failure = 0;
  runtime->soft_off_accepted = false;
  runtime->soft_off_status_ms = 0;
  __atomic_store_n(&runtime->soft_off_pending, false, __ATOMIC_RELEASE);
  runtime->last_error = error;
  syslog(LOG_WARNING, "BKVOICE KEYS soft_off_fail=%d\n", error);
  return error;
}

static int bkvoice_soft_off_progress(struct bkvoice_runtime_s *runtime)
{
  int ret;

  if (!bkvoice_soft_off_pending(runtime))
    {
      return 0;
    }

  if (runtime->soft_off_accepted)
    {
      uint64_t now = bkvoice_now();

      if (now < runtime->soft_off_status_ms)
        {
          return -EAGAIN;
        }

      runtime->soft_off_status_ms = now + BKVOICE_SOFT_OFF_STATUS_POLL_MS;
      ret = bk7258_pm_soft_off_status();
      if (ret > 0) return -EAGAIN;
      if (ret < 0)
        {
          runtime->last_error = ret;
          return -EAGAIN;
        }

      runtime->soft_off_accepted = false;
      return bkvoice_soft_off_fail(runtime,
        runtime->soft_off_failure < 0 ? runtime->soft_off_failure :
                                        -ECANCELED);
    }

  if (runtime->soft_off_failure < 0)
    {
      return bkvoice_soft_off_fail(runtime, runtime->soft_off_failure);
    }

#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
  if (runtime->wake_session != NULL)
    {
      ret = bkvoice_wake_session_step(runtime->wake_session, false,
                                      bkvoice_now());
      if (ret == -EAGAIN) return ret;
      if (ret < 0) return bkvoice_soft_off_fail(runtime, ret);
    }
#endif
  if (runtime->cloud != NULL && bkcloud_runtime_busy(runtime->cloud))
    {
      ret = bkcloud_runtime_cancel_drain(runtime->cloud);
      if (ret == -EAGAIN) return ret;
      if (ret < 0) return bkvoice_soft_off_fail(runtime, ret);
    }

