open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
  if (runtime->session.connected || runtime->receiver_joinable ||
      runtime->cleanup_pending ||
      (runtime->ptt != NULL && runtime->ptt->capture_ready))
    {
      ret = bkvoice_runtime_disconnect(runtime, -ECANCELED);
      if (ret == -EAGAIN) return ret;
      if (ret < 0) return bkvoice_soft_off_fail(runtime, ret);
    }

  sync();
  ret = bk7258_pm_soft_off_request();
  if (ret < 0)
    {
      if (ret == -ENOTSUP || ret == -EBUSY)
        {
          return bkvoice_soft_off_fail(runtime, ret);
        }

      /* The transport may have timed out after CP accepted the tuple. Keep
       * all gates and the storage lease until the read-only status RPC proves
       * CP canceled it. */
      runtime->soft_off_failure = ret;
      runtime->last_error = ret;
      runtime->soft_off_accepted = true;
      runtime->soft_off_status_ms = bkvoice_now();
      return -EAGAIN;
    }

  /* CP accepted the one-shot request. No new AP activity is admitted while
   * the whole-chip reset-to-sleep transition is pending. */
  runtime->soft_off_accepted = true;
  runtime->soft_off_failure = 0;
  runtime->soft_off_status_ms =
    bkvoice_now() + BKVOICE_SOFT_OFF_STATUS_POLL_MS;
  return 0;
}
#endif

static int bkvoice_runtime_clear(struct bkvoice_runtime_s *runtime)
{
  int ret;
#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
  ret = bkvoice_wake_close(runtime);
  if (ret < 0) return ret;
#endif
  ret = bkcloud_runtime_clear(&runtime->cloud);
  if (ret < 0) return ret;
  ret = bkvoice_runtime_disconnect(runtime, -ECANCELED);

  if (ret < 0)
    {
      return ret;
    }

  if (runtime->session.initialized)
    {
      ret = bkvoice_session_uninitialize(&runtime->session);
      if (ret < 0)
        {
          return ret;
        }
    }

  if (runtime->wss.initialized)
    {
      ret = bkvoice_wss_uninitialize(&runtime->wss);
      if (ret < 0)
        {
          return ret;
        }
    }

  if (runtime->tls.initialized)
    {
      ret = bkvoice_tls_uninitialize(&runtime->tls);
      if (ret < 0)
        {
          return ret;
        }
    }

  bkvoice_config_clear(&runtime->config);
  bkvoice_upload_clear(runtime);
  return 0;
}

static int bkvoice_runtime_connect(struct bkvoice_runtime_s *runtime)
{
  struct bkvoice_tls_config_s tls_config;
  struct bkvoice_wss_config_s wss_config;
  const struct bkvoice_session_config_s session_config =
  {
    .gateway =
    {
      .io_timeout_ms = BKVOICE_IO_MS,
#ifdef BKVOICE_RUNTIME_OTA
      .ota_request = bkvoice_ota_request,
      .ota_context = runtime,
#endif
    },
    .initial_downlink_credit = BKVOICE_COMPANION_AUDIO_FRAME_BYTES * 4u,
  };
  pthread_attr_t attr;
  int ret;

  if (!runtime->config.initialized)
    {
      return -ENOKEY;
    }
#ifdef BKVOICE_RUNTIME_OTA
  if (!runtime->ota_store_ready)
    {
      return -EAGAIN;
    }
#endif

  if (runtime->receiver_joinable || runtime->session.connected)
    {
      return -EALREADY;
    }

  ret = bkvoice_config_trusted_time(&runtime->config);
  if (ret < 0)
    {
      return ret;
    }

  if (!runtime->session.initialized)
    {
      memset(&tls_config, 0, sizeof(tls_config));
      tls_config.peer_address = runtime->config.peer_address;
      tls_config.server_ca = &runtime->config.ca;
      tls_config.client_certificate = &runtime->config.certificate;
      tls_config.client_key = &runtime->config.private_key;
      tls_config.now_ms = bkvoice_config_now_ms;
      tls_config.trusted_time = bkvoice_config_trusted_time;
      tls_config.clock_context = &runtime->config;
      ret = bkvoice_tls_initialize(&runtime->tls, &tls_config);
      if (ret < 0)
        {
          return ret;
        }

      wss_config.host = runtime->config.host;
      wss_config.port = runtime->config.port;
      wss_config.path = "/companion/v1";
      wss_config.subprotocol = "companion-v1";
      ret = bkvoice_wss_initialize(&runtime->wss, bkvoice_tls_ops(),
                                   &runtime->tls, &wss_config);
      if (ret < 0)
        {
          (void)bkvoice_tls_uninitialize(&runtime->tls);
          return ret;
        }

      ret = bkvoice_session_initialize(&runtime->session, runtime->ptt,
                                       bkvoice_wss_transport_ops(),
                                       &runtime->wss,
                                       bkvoice_config_now_ms, NULL,
                                       &session_config,
                                       runtime->boot_generation);
      if (ret < 0)
        {
          (void)bkvoice_wss_uninitialize(&runtime->wss);
          (void)bkvoice_tls_uninitialize(&runtime->tls);
          return ret;
        }
    }

  runtime->armed = false;
  runtime->pressed = false;
  runtime->status_connection_generation = 0;
  runtime->status_health_sequence = 0;
  ret = bkvoice_session_connect(&runtime->session,
                                bkvoice_now() + BKVOICE_CONNECT_MS);
  if (ret < 0)
    {
      (void)bkvoice_runtime_disconnect(runtime, ret);
      return ret;
    }

  __atomic_store_n(&runtime->receiver_stop, false, __ATOMIC_RELEASE);
  ret = pthread_attr_init(&attr);
  if (ret == 0)
    {
      ret = pthread_attr_setstacksize(&attr, 8192);
      if (ret == 0)
        {
          ret = pthread_create(&runtime->receiver, &attr, bkvoice_receiver,
                                runtime);
        }

      (void)pthread_attr_destroy(&attr);
    }

  if (ret != 0)
    {
      (void)bkvoice_runtime_disconnect(runtime, -ret);
      return -ret;
    }

  runtime->receiver_joinable = true;
  runtime->last_error = 0;
  syslog(LOG_NOTICE, "BKVOICE COMPANION connected=1 ready=0 mtls=1\n");
  return 0;
}

static int bkvoice_decimal(const char *text, size_t limit, size_t *value)
{
  size_t result = 0;

  if (*text == '\0')
    {
      return -EINVAL;
    }

  for (; *text != '\0'; text++)
    {
      if (*text < '0' || *text > '9' || result > limit / 10u)
        {
          return -EINVAL;
        }

      result = result * 10u + (unsigned int)(*text - '0');
      if (result > limit)
        {
          return -EINVAL;
        }
    }

  *value = result;
  return 0;
}

