open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
static int bkvoice_hex(char value)
{
  if (value >= '0' && value <= '9')
    {
      return value - '0';
    }

  if (value >= 'a' && value <= 'f')
    {
      return value - 'a' + 10;
    }

  if (value >= 'A' && value <= 'F')
    {
      return value - 'A' + 10;
    }

  return -1;
}

#ifdef CONFIG_BK7258_PROVISION_GATT
static bool bkvoice_provision_available(void *context)
{
  struct bkvoice_runtime_s *runtime = context;
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime)) return false;
#endif
#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
  if (runtime->wake_session != NULL &&
      bkvoice_wake_session_suspend(runtime->wake_session) < 0)
    {
      return false;
    }
#endif
  return !runtime->config.initialized && !runtime->receiver_joinable &&
         !runtime->session.connected && !runtime->ptt->capture_ready &&
         runtime->upload == NULL && !runtime->cleanup_pending
#ifdef BKVOICE_RUNTIME_OTA
         && runtime->ota_store_ready
#endif
         ;
}
static int bkvoice_provision_load(void *context, const void *data, size_t size)
{
  struct bkvoice_runtime_s *runtime = context;
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime)) return -ESHUTDOWN;
#endif
  return bkvoice_config_load(&runtime->config, data, size);
}
static int bkvoice_provision_load_cloud(void *context, const void *trust,
                                        size_t trust_size, const void *cloud,
                                        size_t cloud_size)
{
  struct bkvoice_runtime_s *runtime = context;
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime)) return -ESHUTDOWN;
#endif
  int ret = bkvoice_config_load(&runtime->config, trust, trust_size);
  if (ret == 0)
    ret = bkcloud_runtime_create(&runtime->cloud, cloud, cloud_size,
                                 &runtime->config, runtime->ptt, runtime->wake);
  return ret;
}
static int bkvoice_provision_connect(void *context)
{
  struct bkvoice_runtime_s *runtime = context;
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime)) return -ESHUTDOWN;
#endif
  return runtime->cloud ? bkcloud_runtime_connect(runtime->cloud) :
                          bkvoice_runtime_connect(runtime);
}
static int bkvoice_provision_ready(void *context)
{
  struct bkvoice_runtime_s *runtime = context;
  if (runtime->cloud) return bkcloud_runtime_ready(runtime->cloud);
  if (!runtime->session.connected)
    return runtime->last_error < 0 ? runtime->last_error : -ENOTCONN;
  return runtime->session.ready ? 1 : 0;
}
static int bkvoice_provision_clear(void *context)
{
  struct bkvoice_runtime_s *runtime = context;
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime)) return -ESHUTDOWN;
#endif
  return bkvoice_runtime_clear(runtime);
}
static const struct bkprov_voice_ops_s g_provision_voice =
{
  bkvoice_provision_available, bkvoice_provision_load, bkvoice_provision_connect,
  bkvoice_provision_ready, bkvoice_provision_clear, bkvoice_provision_load_cloud
};

static int bkvoice_identity_bind(struct bkvoice_runtime_s *runtime)
{
  int ret = bkprov_network_bind(&runtime->identity, &g_provision_voice, runtime);
  if (ret == 0)
    ret = bkprov_owner_bind(&runtime->identity.certificate, &runtime->identity.key,
                            runtime->identity.secret, bkprov_network_ops(), NULL);
  if (ret < 0) (void)bkprov_network_unbind();
  else runtime->identity_bound = true;
  return ret;
}

static void bkvoice_identity_progress(struct bkvoice_runtime_s *runtime)
{
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime)) return;
#endif
#ifdef BKVOICE_RUNTIME_OTA
  if (__atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE) !=
      BKVOICE_OTA_JOB_EMPTY)
    {
      return;
    }
#endif
  if (runtime->identity_pending)
    {
      int ret = bkprov_storage_identity_install(runtime->identity.record, runtime->identity.size);
      if (ret == -EAGAIN) return;
      if (ret == 0) ret = bkvoice_identity_bind(runtime);
      runtime->identity_result = ret;
      runtime->identity_pending = false;
      if (ret < 0) runtime->last_error = ret;
      return;
    }
  if (runtime->identity.record != NULL || runtime->upload != NULL ||
      bkvoice_now() < runtime->provision_restore_ms) return;
  runtime->provision_restore_ms = bkvoice_now() + 1000;
  uint8_t *record = malloc(BKVOICE_CONFIG_MAX_BYTES);
  if (record == NULL) return;
  size_t size;
  int ret = bkprov_storage_identity(record, BKVOICE_CONFIG_MAX_BYTES, &size);
  if (ret == 0)
    {
      ret = bkprov_identity_load(&runtime->identity, record, size);
      if (ret == 0) ret = bkvoice_identity_bind(runtime);
      runtime->identity_result = ret;
      if (ret < 0) runtime->last_error = ret;
    }
  else if (ret == -ENODEV || ret == -EXDEV || ret == -ENOTCONN)
    {
      (void)bkprov_storage_refresh();
    }
  mbedtls_platform_zeroize(record, BKVOICE_CONFIG_MAX_BYTES);
  free(record);
}

static void bkvoice_configuration_progress(struct bkvoice_runtime_s *runtime)
{
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime)) return;
#endif
#ifdef BKVOICE_RUNTIME_OTA
  if (__atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE) !=
      BKVOICE_OTA_JOB_EMPTY)
    {
      return;
    }
#endif
  if (!runtime->identity_bound || runtime->identity_pending ||
      bkprov_network_busy() || bkprov_owner_busy() ||
      !bkvoice_provision_available(runtime) ||
      bkvoice_now() < runtime->configuration_restore_ms) return;
  runtime->configuration_restore_ms = bkvoice_now() + 10000;
  uint8_t *bundle = malloc(BKPROV_BUNDLE_MAX);
  if (bundle == NULL) return;
  size_t size;
  uint64_t revision;
  uint8_t transaction[16];
  int ret = bkprov_storage_snapshot(bundle, BKPROV_BUNDLE_MAX, &size, &revision, transaction);
  if (ret == 0) ret = bkprov_network_restore(bundle, size);
  if (ret < 0 && ret != -ENOENT && ret != -EAGAIN) runtime->last_error = ret;
  mbedtls_platform_zeroize(bundle, BKPROV_BUNDLE_MAX);
  free(bundle);
}

static void bkvoice_control_progress(struct bkvoice_runtime_s *runtime)
{
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime)) return;
#endif
  if (!runtime->identity_bound || runtime->identity_pending ||
      bkprov_owner_busy() || bkprov_network_busy() ||
      bkvoice_now() < runtime->control_refresh_ms) return;
  runtime->control_refresh_ms = bkvoice_now() + 5000u;
  uint8_t *bundle = malloc(BKPROV_BUNDLE_MAX);
  if (bundle == NULL) return;
  size_t size;
  uint64_t revision;
  uint8_t transaction[16];
  struct bkprov_settings_s settings;
  memset(&settings, 0, sizeof(settings));
  int ret = bkprov_storage_snapshot(bundle, BKPROV_BUNDLE_MAX, &size,
                                    &revision, transaction);
  if (ret == 0) ret = bkprov_settings_decode(&settings, bundle, size);
  if (ret == 0 && settings.control_key != NULL)
    {
      ret = bkprov_owner_control(settings.control_key,
                                 bkvoice_runtime_control, runtime);
#ifdef BKVOICE_RUNTIME_OTA
      if (ret == 0)
        {
          ret = bkprov_owner_control_ota(bkvoice_runtime_control_ota);
        }
#endif
      if (ret < 0)
        {
          (void)bkprov_owner_control(NULL, NULL, NULL);
          runtime->last_error = ret;
        }
      if (runtime->cloud != NULL)
        (void)bkcloud_runtime_memory_owner(runtime->cloud, settings.control_key);
    }
  else
    (void)bkprov_owner_control(NULL, NULL, NULL);
  mbedtls_platform_zeroize(&settings, sizeof(settings));
  mbedtls_platform_zeroize(bundle, BKPROV_BUNDLE_MAX);
  free(bundle);
}
#endif

int bkvoice_runtime_command(const struct bkvoice_rpc_request_s *request,
                            struct bkvoice_rpc_response_s *response)
{
  struct bkvoice_runtime_s *runtime = &g_runtime;
  size_t count;
  size_t offset;
  int ret = 0;

#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime)) return -ESHUTDOWN;
#endif

#ifdef CONFIG_BK7258_PROVISION_GATT
  if (bkprov_owner_busy() || bkprov_network_busy()) return -EBUSY;
  if (runtime->identity_pending && request->command != BKVOICE_RPC_CONFIG_COMMIT)
    return -EBUSY;
#endif

  switch (request->command)
    {
#ifdef CONFIG_BK7258_VOICE_HIL_TEST
      case BKVOICE_RPC_HIL_CAPTURE:
        ret = bkvoice_decimal(request->manifest, 5000, &count);
        if (ret < 0 || count < 200) return -EINVAL;
        if (runtime->cloud)
          {
            struct bkcloud_runtime_status_s cloud;
            bkcloud_runtime_status(runtime->cloud, &cloud);
            if (!cloud.ready) return -ENOTCONN;
            if (runtime->test_until || !cloud.armed || cloud.busy)
              return -EBUSY;
            runtime->test_until = bkvoice_now() + count;
            syslog(LOG_NOTICE, "BKVOICE HIL cloud start ms=%u physical=0\n",
                   (unsigned int)count);
            break;
          }
        if (!runtime->session.ready) return -ENOTCONN;
        if (runtime->test_until != 0 || runtime->pressed || !runtime->armed ||
            runtime->ptt->turn.state != BKVOICE_TURN_IDLE) return -EBUSY;
        runtime->test_until = bkvoice_now() + count;
        syslog(LOG_NOTICE, "BKVOICE HIL start ms=%u physical=0\n",
               (unsigned int)count);
        break;
#endif
      case BKVOICE_RPC_CONNECT:
        ret = runtime->cloud ? -EALREADY : bkvoice_runtime_connect(runtime);
        break;

      case BKVOICE_RPC_DISCONNECT:
        ret = runtime->cloud ? bkvoice_runtime_clear(runtime) :
                               bkvoice_runtime_disconnect(runtime, -ECANCELED);
        break;

      case BKVOICE_RPC_CONFIG_CLEAR:
        ret = bkvoice_runtime_clear(runtime);
        break;

      case BKVOICE_RPC_CONFIG_BEGIN:
        if (bkvoice_runtime_busy())
          {
            return -EBUSY;
          }

        ret = bkvoice_decimal(request->manifest, BKVOICE_CONFIG_MAX_BYTES,
                              &count);
        if (ret < 0 || count < 32)
          {
            return -EINVAL;
          }

