open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
        ret = bkvoice_runtime_clear(runtime);
        if (ret < 0)
          {
            return ret;
          }

        runtime->upload = calloc(1, count);
        if (runtime->upload == NULL)
          {
            return -ENOMEM;
          }

        runtime->upload_size = count;
        runtime->upload_deadline = bkvoice_now() + BKVOICE_UPLOAD_MS;
        break;

      case BKVOICE_RPC_CONFIG_DATA:
        count = strlen(request->manifest);
        ret = bkvoice_decimal(request->clip_id, BKVOICE_CONFIG_MAX_BYTES,
                              &offset);
        if (runtime->upload == NULL || ret < 0 || count == 0 ||
            count % 2 != 0 || count > BKVOICE_PROVISION_CHUNK_BYTES * 2u ||
            offset > runtime->uploaded ||
            count / 2u > runtime->upload_size - offset)
          {
            return -EINVAL;
          }

        if (offset < runtime->uploaded &&
            count / 2u > runtime->uploaded - offset)
          {
            return -EINVAL;
          }

        for (size_t i = 0; i < count; i += 2)
          {
            int high = bkvoice_hex(request->manifest[i]);
            int low = bkvoice_hex(request->manifest[i + 1]);
            if (high < 0 || low < 0)
              {
                bkvoice_upload_clear(runtime);
                return -EINVAL;
              }

            if (offset < runtime->uploaded &&
                runtime->upload[offset + i / 2u] != (high * 16 + low))
              {
                bkvoice_upload_clear(runtime);
                return -EPROTO;
              }

            runtime->upload[offset + i / 2u] = high * 16 + low;
          }

        if (offset == runtime->uploaded)
          {
            runtime->uploaded += count / 2u;
          }

        runtime->upload_deadline = bkvoice_now() + BKVOICE_UPLOAD_MS;
        response->data_bytes = runtime->uploaded;
        break;

      case BKVOICE_RPC_CONFIG_COMMIT:
        if (runtime->upload == NULL ||
            runtime->uploaded != runtime->upload_size)
          {
            return -ENODATA;
          }

#ifdef CONFIG_BK7258_PROVISION_GATT
        if (runtime->upload_size >= 4 && !memcmp(runtime->upload, "BPI1", 4))
          {
            if (runtime->identity.record == NULL)
              {
                ret = bkprov_identity_load(&runtime->identity, runtime->upload,
                                            runtime->upload_size);
                if (ret == 0)
                  {
                    runtime->identity_pending = true;
                    runtime->identity_result = -EAGAIN;
                  }
              }
            else if (runtime->identity.size != runtime->upload_size ||
                     memcmp(runtime->identity.record, runtime->upload, runtime->upload_size))
              ret = -EEXIST;
            if (ret == 0)
              {
                bkvoice_identity_progress(runtime);
                ret = runtime->identity_pending ? -EAGAIN : runtime->identity_result;
              }
            if (ret == -EAGAIN)
              {
                runtime->upload_deadline = bkvoice_now() + BKVOICE_UPLOAD_MS;
                return ret;
              }
          }
        else
#endif
          ret = bkvoice_config_load(&runtime->config, runtime->upload,
                                    runtime->upload_size);
        bkvoice_upload_clear(runtime);
        break;

      default:
        ret = -ENOSYS;
        break;
    }

  if (ret < 0)
    {
      runtime->last_error = ret;
    }

  return ret;
}

void bkvoice_runtime_step(bool command_link)
{
  struct bkvoice_runtime_s *runtime = &g_runtime;
#ifndef CONFIG_BK7258_PRODUCT_KEYS
  struct bkvoice_turn_token_s token;
#endif
  uint64_t now = bkvoice_now();
  uint32_t epoch = 0;
  bool level = false;
  bool link = false;
#ifndef CONFIG_BK7258_PRODUCT_KEYS
  irqstate_t flags;
#endif
  int ret;

#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime))
    {
      (void)bkvoice_soft_off_progress(runtime);
      return;
    }
#endif

#ifdef BKVOICE_RUNTIME_OTA
  bkvoice_ota_restore_progress(runtime);
#endif
#ifdef CONFIG_BK7258_PROVISION_GATT
  bkvoice_identity_progress(runtime);
  bkprov_network_step();
  bkvoice_configuration_progress(runtime);
  bkvoice_control_progress(runtime);
  now = bkvoice_now();
#ifndef CONFIG_BK7258_PRODUCT_KEYS
  /* Lease snapshot is taken before any early return, including offline voice.
   * Only this worker can translate physical input into a local confirmation.
   */
  flags = spin_lock_irqsave(&runtime->button_lock);
  epoch = runtime->button_epoch;
  link = command_link && runtime->button_link && runtime->button_sequence != 0 &&
         now >= runtime->button_received_ms &&
         now - runtime->button_received_ms < BKVOICE_BUTTON_LEASE_MS;
  level = runtime->button_pressed;
  spin_unlock_irqrestore(&runtime->button_lock, flags);
  bool pairing = bkprov_owner_step(now, epoch, link, level,
                     runtime->cloud ? !bkcloud_runtime_busy(runtime->cloud) :
                     !runtime->session.connected && !runtime->receiver_joinable &&
                     !runtime->ptt->capture_ready && runtime->upload == NULL &&
                     !runtime->cleanup_pending && !bkprov_network_busy());
#else
  bool pairing = bkprov_owner_step(now, 0, false, false,
                     runtime->cloud ? !bkcloud_runtime_busy(runtime->cloud) :
                     !runtime->session.connected && !runtime->receiver_joinable &&
                     !runtime->ptt->capture_ready && runtime->upload == NULL &&
                     !runtime->cleanup_pending && !bkprov_network_busy());
#endif
#endif

#ifdef CONFIG_BK7258_PRODUCT_KEYS
  /* Product keys are never a provisioning confirmation or a PTT level. */
  bkvoice_runtime_product_keys(runtime, command_link, now);
  epoch = runtime->boot_generation;
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime))
    {
      (void)bkvoice_soft_off_progress(runtime);
      return;
    }
#endif
#endif

#ifdef BKVOICE_RUNTIME_OTA
  if (runtime->ota_direct &&
      __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE) !=
        BKVOICE_OTA_JOB_EMPTY)
    {
#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
      if (runtime->wake_session != NULL)
        {
          ret = bkvoice_wake_session_step(runtime->wake_session, false, now);
          if (ret < 0)
            {
              runtime->last_error = ret;
              return;
            }
        }
#endif
      ret = bkvoice_ota_step(runtime);
      if (ret < 0)
        {
          runtime->last_error = ret;
          syslog(LOG_WARNING, "BKVOICE OTA progress_fail=%d\n", ret);
        }

      return;
    }
#endif

