open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
  if (runtime->cloud)
    {
#ifdef CONFIG_BK7258_PROVISION_GATT
      /* A successful service probe is not a committed configuration.  The
       * configuration transaction remains exclusive until it commits.
       */
      if (bkprov_network_busy())
        {
#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
          if (runtime->wake_session != NULL)
            {
              ret = bkvoice_wake_session_step(runtime->wake_session, false,
                                              now);
              if (ret < 0) runtime->last_error = ret;
            }
#endif
          return;
        }
      if (pairing)
        {
#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
          if (runtime->wake_session != NULL)
            {
              ret = bkvoice_wake_session_step(runtime->wake_session, false,
                                              now);
              if (ret < 0)
                {
                  runtime->last_error = ret;
                  return;
                }
            }
#endif
          if (bkcloud_runtime_busy(runtime->cloud))
            {
              (void)bkcloud_runtime_cancel(runtime->cloud);
              bkcloud_runtime_step(runtime->cloud, false, false, epoch);
            }
          return;
        }
#endif
#ifdef CONFIG_BK7258_PRODUCT_KEYS
      /* Service transport follows its command link, never a GPIO lease. */
      epoch = runtime->boot_generation;
      link = command_link;
      level = false;
#else
      flags = spin_lock_irqsave(&runtime->button_lock);
      epoch = runtime->button_epoch;
      level = runtime->button_pressed;
      link = command_link && runtime->button_link && runtime->button_sequence != 0 &&
             now >= runtime->button_received_ms &&
             now - runtime->button_received_ms < BKVOICE_BUTTON_LEASE_MS;
      spin_unlock_irqrestore(&runtime->button_lock, flags);
#endif
#ifdef CONFIG_BK7258_VOICE_HIL_TEST
      if (runtime->test_until)
        {
          link = true;
          level = bkvoice_now() < runtime->test_until;
        }
#endif
#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
      ret = bkvoice_wake_prepare(runtime);
      if (ret == 0)
        {
          if (level)
            {
              ret = bkvoice_wake_session_suspend(runtime->wake_session);
            }
          else
            {
              /* Continuous listening follows the authenticated service
               * channel, not the physical button lease.  Disconnect drains
               * a wake-owned turn and releases the microphone. */
              ret = bkvoice_wake_session_step(runtime->wake_session,
                                              command_link, now);
            }
          if (ret < 0 && ret != -EAGAIN && ret != runtime->wake_result)
            {
              runtime->last_error = ret;
              runtime->wake_result = ret;
              syslog(LOG_WARNING, "BKVOICE WAKE progress_fail=%d\n", ret);
            }
          else if (ret >= 0)
            {
              runtime->wake_result = 0;
            }
          /* Only an instantiated listener can hold the MIC needed by the
           * manual/HIL entry.  A missing or rejected model never blocks it. */
          if (level && ret < 0)
            {
              return;
            }
        }
#endif
      bkcloud_runtime_step(runtime->cloud, link, level, epoch);
#ifdef CONFIG_BK7258_VOICE_HIL_TEST
      if (runtime->test_until && bkvoice_now() >= runtime->test_until &&
          !bkcloud_runtime_busy(runtime->cloud)) runtime->test_until = 0;
#endif
      return;
    }

  if (runtime->cleanup_pending)
    {
      (void)bkvoice_runtime_disconnect(runtime, -ECANCELED);
      return;
    }

  if (runtime->upload != NULL &&
      (!command_link || now >= runtime->upload_deadline))
    {
      bkvoice_upload_clear(runtime);
    }

  if (!command_link)
    {
      if (runtime->session.connected || runtime->receiver_joinable)
        {
          (void)bkvoice_runtime_disconnect(runtime, -ENOTCONN);
        }

      return;
    }

  for (unsigned int i = 0; i < BKVOICE_RX_SLOTS; i++)
    {
      uint32_t tail = __atomic_load_n(&runtime->rx_tail, __ATOMIC_RELAXED);
      uint32_t head = __atomic_load_n(&runtime->rx_head, __ATOMIC_ACQUIRE);
      bool ready = runtime->session.ready;

      if (tail == head)
        {
          break;
        }

      ret = bkvoice_session_dispatch_frame(&runtime->session,
                                           &runtime->rx[tail % BKVOICE_RX_SLOTS]);
      __atomic_store_n(&runtime->rx_tail, tail + 1u, __ATOMIC_RELEASE);
      if (ret < 0 && ret != -ESTALE)
        {
          runtime->last_error = ret;
          syslog(LOG_WARNING, "BKVOICE COMPANION rx_fail=%d\n", ret);
          (void)bkvoice_runtime_disconnect(runtime, ret);
          break;
        }

      if (!ready && runtime->session.ready)
        {
          syslog(LOG_NOTICE, "BKVOICE COMPANION connected=1 ready=1 mtls=1\n");
        }
    }

#ifdef BKVOICE_RUNTIME_OTA
  ret = bkvoice_ota_step(runtime);
  if (ret < 0)
    {
      runtime->last_error = ret;
      syslog(LOG_WARNING, "BKVOICE OTA progress_fail=%d\n", ret);
      (void)bkvoice_runtime_disconnect(runtime, ret);
      return;
    }
#endif

  ret = bkvoice_session_poll(&runtime->session);
  if (ret < 0)
    {
      runtime->last_error = ret;
      syslog(LOG_WARNING, "BKVOICE playback completion failed=%d\n", ret);
      (void)bkvoice_runtime_disconnect(runtime, ret);
      return;
    }

#ifndef CONFIG_BK7258_PRODUCT_KEYS
  flags = spin_lock_irqsave(&runtime->button_lock);
  epoch = runtime->button_epoch;
  link = runtime->button_link && runtime->button_sequence != 0 &&
         now >= runtime->button_received_ms &&
         now - runtime->button_received_ms < BKVOICE_BUTTON_LEASE_MS;
  level = runtime->button_pressed;
  spin_unlock_irqrestore(&runtime->button_lock, flags);

#ifdef CONFIG_BK7258_VOICE_HIL_TEST
  bool test_active = runtime->test_until != 0;
  if (test_active)
    {
      link = true;
      level = bkvoice_now() < runtime->test_until;
    }
#endif

  if (epoch != runtime->owner_button_epoch || !link ||
#ifdef CONFIG_BK7258_PROVISION_GATT
      pairing || bkprov_network_busy() ||
#endif
#ifdef BKVOICE_RUNTIME_OTA
      __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE) !=
        BKVOICE_OTA_JOB_EMPTY ||
#endif
      !runtime->session.ready)
    {
      if (runtime->pressed && runtime->session.ready)
        {
          ret = bkvoice_session_cancel(&runtime->session, -ENOTCONN);
          runtime->last_error = ret < 0 ? ret : -ENOTCONN;
          runtime->cleanup_pending = ret < 0;
          syslog(LOG_WARNING, "BKVOICE PTT lease_lost=1 ret=%d\n", ret);
        }

