open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
      runtime->pressed = false;
      runtime->armed = false;
      runtime->owner_button_epoch = epoch;
    }
  else if (!level)
    {
      if (runtime->pressed)
        {
          ret = bkvoice_session_ptt_up(&runtime->session, now);
          runtime->last_error = ret;
          runtime->cleanup_pending = ret < 0;
          syslog(LOG_NOTICE, "BKVOICE PTT released=1 ret=%d\n", ret);
        }

      runtime->pressed = false;
      runtime->armed = true;
    }
  else if (runtime->armed && !runtime->pressed)
    {
      runtime->armed = false;
      ret = bkvoice_session_ptt_down(&runtime->session, now, &token);
      runtime->last_error = ret;
      runtime->cleanup_pending = ret < 0 && runtime->ptt->worker_joinable;
      runtime->pressed = ret >= 0;
      if (ret >= 0)
        {
#ifdef CONFIG_BK7258_VOICE_HIL_TEST
          if (!test_active)
#endif
            runtime->presses++;
        }

      syslog(LOG_NOTICE, "BKVOICE PTT pressed=1 accepted=%u ret=%d\n",
             ret >= 0 ? 1 : 0, ret);
    }

#ifdef CONFIG_BK7258_VOICE_HIL_TEST
  if (test_active && (!level || !runtime->pressed))
    {
      runtime->test_until = 0;
    }
#endif

#endif /* !CONFIG_BK7258_PRODUCT_KEYS */

  if (runtime->session.ready)
    {
      ret = bkvoice_session_timeout(&runtime->session, now);
      if (ret < 0)
        {
          runtime->last_error = ret;
          runtime->armed = false;
          runtime->pressed = false;
          runtime->cleanup_pending = true;
        }
    }

  ret = bkvoice_runtime_report_device_status(runtime);
  if (ret < 0 && ret != -EBUSY)
    {
      runtime->last_error = ret;
      syslog(LOG_WARNING, "BKVOICE COMPANION status_fail=%d\n", ret);
      (void)bkvoice_runtime_disconnect(runtime, ret);
    }
}

int bkvoice_runtime_control(void *context, enum bkcontrol_command_e command,
                            uint32_t value, struct bkcontrol_status_s *status)
{
  struct bkcloud_runtime_status_s cloud;
  int ret = 0;
  (void)context;
  if (status == NULL) return -EINVAL;
  memset(status, 0xff, sizeof(*status));
  status->flags = 0;
  status->error = 0;
  if (command == BKCONTROL_INFO)
    {
#ifdef CONFIG_BK7258_OTA_MANAGER
      struct bk7258_ota_pair_snapshot_s pair;
      int pair_ret;

      if (!g_runtime.firmware_identity_valid)
        {
          return -EAGAIN;
        }

      memset(&pair, 0, sizeof(pair));
      pair_ret = bk7258_ota_rpmsg_pair_status(
        &pair, CONFIG_BK7258_OTA_RPMSG_CONTROL_TIMEOUT_MS);
      if (pair_ret < 0 || pair.state != BK7258_OTA_PAIR_CONFIRMED ||
          !pair.security_counter_present || pair.security_counter == 0u ||
          !bk7258_mcuboot_version_equal(&pair.version,
                                        &g_runtime.firmware_version))
        {
          return -EAGAIN;
        }

      status->device_info.major = g_runtime.firmware_version.major;
      status->device_info.minor = g_runtime.firmware_version.minor;
      status->device_info.revision = g_runtime.firmware_version.revision;
      status->device_info.build = g_runtime.firmware_version.build;
      status->device_info.security_counter = pair.security_counter;
      return 0;
#else
      return -EAGAIN;
#endif
    }
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(&g_runtime) && command != BKCONTROL_STATUS)
    return -ESHUTDOWN;
#endif
  /* Identity/version and local link status remain available when the cloud
   * service has not been configured or cannot be created.  Mutations retain
   * their existing readiness gate.
   */
  if (g_runtime.cloud == NULL && command != BKCONTROL_STATUS) return -ENOTCONN;
  switch (command)
    {
      case BKCONTROL_STATUS:
        break;
      case BKCONTROL_CANCEL:
        ret = bkcloud_runtime_cancel(g_runtime.cloud);
        break;
      case BKCONTROL_CLEAR_HISTORY:
        if (bkvoice_runtime_settings_busy()) return -EBUSY;
        ret = bkcloud_runtime_clear_history(g_runtime.cloud);
        break;
      case BKCONTROL_MEMORY_SET:
      case BKCONTROL_MEMORY_DELETE:
        if (command == BKCONTROL_MEMORY_SET && value > 1u) return -EINVAL;
        if (bkvoice_runtime_settings_busy()) return -EBUSY;
        ret = bkcloud_runtime_memory_set(g_runtime.cloud, value != 0,
                                         command == BKCONTROL_MEMORY_DELETE);
        break;
      case BKCONTROL_VOLUME:
      case BKCONTROL_PERSONA:
        if (value > (command == BKCONTROL_VOLUME ? 100u : 4u)) return -EINVAL;
        if (bkvoice_runtime_settings_busy()) return -EBUSY;
#ifdef CONFIG_BK7258_PREFERENCES
        ret = command == BKCONTROL_VOLUME ? bk7258_preferences_set_volume(value) :
              bk7258_preferences_set_persona(bk7258_preferences_persona_name(value));
#else
        ret = -ENOTSUP;
#endif
        break;
      default:
        return -EINVAL;
    }
  if (ret < 0) return ret;
  bkcloud_runtime_status(g_runtime.cloud, &cloud);
  status->flags = (cloud.ready ? 1u : 0u) | (cloud.busy ? 2u : 0u) |
      (cloud.memory_known ? 32u : 0u) | (cloud.memory_enabled ? 64u : 0u) |
      (cloud.memory_pending ? 128u : 0u) | (cloud.memory_failed ? 256u : 0u) |
      (cloud.memory_supported ? 512u : 0u);
#ifdef CONFIG_BK7258_OTA_MANAGER
  status->flags |= 4096u;
#endif
#ifdef BKVOICE_RUNTIME_OTA
  status->flags |= 8192u;
#endif
#ifdef CONFIG_BK7258_WIFI_VNET
  /* A coherent local link snapshot plus the AP lease, not an Internet or
   * provider reachability claim. No credential, address or SSID is exposed.
   */
  struct bk7258_wifi_result_s wifi;
  if (bk7258_wifi_read_link(&wifi) == 0)
    {
      status->flags |= 1024u;
      if (wifi.ipaddr != 0 && bk7258_wifi_native_lease_matches(&wifi))
        status->flags |= 2048u;
    }
#endif
  if (cloud.turn_state != UINT32_MAX)
    {
      status->flags |= 4u;
      status->turn = cloud.turn_state;
      status->error = cloud.last_error;
    }
#ifdef CONFIG_BK7258_PREFERENCES
  /* Never add filesystem work to cancellation or an in-flight audio turn.
   * A failed preference read leaves the fields explicitly unknown.
   */
  if (command != BKCONTROL_CANCEL && command != BKCONTROL_CLEAR_HISTORY &&
      !cloud.busy &&
      cloud.turn_state == BKVOICE_TURN_IDLE)
    {
      struct bk7258_preferences_s preferences;
      if (bk7258_preferences_get(&preferences) == 0)
        {
          status->flags |= 8u | 16u;
          status->volume = preferences.volume_percent;
          status->persona = preferences.persona;
        }
    }
#endif
  return 0;
}

int bkvoice_runtime_control_ota(void *context,
                               enum bkcontrol_command_e command,
                               const uint8_t *record, size_t size,
                               struct bkcontrol_status_s *status)
{
#ifdef BKVOICE_RUNTIME_OTA
  struct bkvoice_runtime_s *runtime = context;
  struct bkcontrol_ota_request_s *request;
  bool direct;
  int terminal_result;
  int ret;

  if (runtime != &g_runtime || status == NULL)
    {
      return -EINVAL;
    }

