open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
  bkvoice_ota_status_unknown(&status->ota);
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime) && command != BKCONTROL_OTA_STATUS)
    return -ESHUTDOWN;
#endif
  if (command == BKCONTROL_OTA_STATUS)
    {
      if (record != NULL || size != 0)
        {
          return -EINVAL;
        }

      return bkvoice_ota_control_status(runtime, &status->ota);
    }

  if (command == BKCONTROL_OTA_CANCEL)
    {
      if (record != NULL || size != 0)
        {
          return -EINVAL;
        }

      direct = runtime->ota_direct || runtime->ota_intent_present;
      ret = bkvoice_ota_cancel_control(runtime, &terminal_result);
      if (ret == 0)
        {
          if (direct)
            {
              runtime->ota_result = terminal_result;
              runtime->ota_target_valid = false;
              __atomic_store_n(&runtime->ota_job_state,
                               BKVOICE_OTA_JOB_DONE, __ATOMIC_RELEASE);
            }

          ret = bkvoice_ota_store_clear_runtime(runtime);
          if (ret == 0)
            {
              bkvoice_ota_clear(runtime);
            }
        }

      if (ret < 0)
        {
          (void)bkvoice_ota_control_status(runtime, &status->ota);
          return ret;
        }

      bkvoice_ota_status_unknown(&runtime->ota_direct_status);
      if (direct)
        {
          runtime->ota_direct_status.state = BKVOICE_CONTROL_OTA_TERMINAL;
          runtime->ota_direct_status.phase = BKVOICE_COMPANION_OTA_FAILED;
          runtime->ota_direct_status.result = terminal_result;
          runtime->ota_direct_status_valid = true;
        }
      else
        {
          runtime->ota_direct_status_valid = false;
        }

      status->ota = runtime->ota_direct_status;
      return ret;
    }

  if (command != BKCONTROL_OTA_START || record == NULL)
    {
      return -EINVAL;
    }

  request = calloc(1, sizeof(*request));
  if (request == NULL)
    {
      return -ENOMEM;
    }

  ret = bkcontrol_ota_request_parse(record, size, request);
  if (ret < 0)
    {
      goto free_request;
    }

  if (!runtime->initialized || !runtime->firmware_identity_valid)
    {
      ret = -EAGAIN;
      goto free_request;
    }

  if (!runtime->ota_store_ready)
    {
      ret = -EAGAIN;
      goto free_request;
    }

#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
  if (runtime->wake_session != NULL)
    {
      ret = bkvoice_wake_session_step(runtime->wake_session, false,
                                      bkvoice_now());
      if (ret < 0)
        {
          goto free_request;
        }
    }
#endif

  if (runtime->ota_direct_request != NULL ||
      __atomic_load_n(&runtime->ota_job_state, __ATOMIC_ACQUIRE) !=
        BKVOICE_OTA_JOB_EMPTY ||
      (runtime->cloud != NULL && bkcloud_runtime_busy(runtime->cloud)) ||
      runtime->receiver_joinable || runtime->session.connected ||
      runtime->upload != NULL || runtime->cleanup_pending || runtime->pressed ||
      (runtime->ptt != NULL && runtime->ptt->capture_ready))
    {
      ret = -EBUSY;
      goto free_request;
    }
#ifdef CONFIG_BK7258_PROVISION_GATT
  if (runtime->identity_pending || bkprov_network_busy())
    {
      ret = -EBUSY;
      goto free_request;
    }
#endif

  runtime->ota_direct_request = request;
  runtime->ota_direct = true;
  runtime->ota_direct_status_valid = true;
  bkvoice_ota_status_unknown(&runtime->ota_direct_status);
  runtime->ota_direct_status.state = BKVOICE_CONTROL_OTA_QUEUED;
  runtime->ota_direct_status.phase = BKVOICE_COMPANION_OTA_DOWNLOADING;
  runtime->ota_direct_status.progress = 0u;
  runtime->ota_direct_status.total = 100u;
  runtime->ota_direct_status.result = -EINPROGRESS;
  ret = bkvoice_ota_request(runtime, 1u, request->catalog_sha256);
  if (ret < 0)
    {
      runtime->ota_direct_request = NULL;
      runtime->ota_direct = false;
      runtime->ota_direct_status_valid = false;
      goto free_request;
    }

  status->ota = runtime->ota_direct_status;
  return 0;

free_request:
  mbedtls_platform_zeroize(request, sizeof(*request));
  free(request);
  return ret;
#else
  (void)context;
  (void)command;
  (void)record;
  (void)size;
  (void)status;
  return -ENOTSUP;
#endif
}

bool bkvoice_runtime_settings_busy(void)
{
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(&g_runtime)) return true;
#endif
  if (!g_runtime.cloud) return bkvoice_runtime_busy();
#ifdef CONFIG_BK7258_PROVISION_GATT
  if (bkprov_owner_pairing() || bkprov_network_busy() || g_runtime.identity_pending)
    return true;
#endif
  struct bkcloud_runtime_status_s cloud;
  bkcloud_runtime_status(g_runtime.cloud, &cloud);
  return !cloud.ready || cloud.busy || cloud.turn_state != BKVOICE_TURN_IDLE;
}

bool bkvoice_runtime_busy(void)
{
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(&g_runtime)) return true;
#endif
  if (bkcloud_runtime_busy(g_runtime.cloud)) return true;
#ifdef CONFIG_BK7258_PROVISION_GATT
  if (bkprov_owner_busy() || bkprov_network_busy() || g_runtime.identity_pending) return true;
#endif
#ifdef BKVOICE_RUNTIME_OTA
  if (__atomic_load_n(&g_runtime.ota_job_state, __ATOMIC_ACQUIRE) !=
      BKVOICE_OTA_JOB_EMPTY)
    {
      return true;
    }
#endif
  return g_runtime.receiver_joinable || g_runtime.session.connected ||
         (g_runtime.ptt != NULL && g_runtime.ptt->capture_ready);
}

void bkvoice_runtime_status(struct bkvoice_rpc_response_s *response)
{
  struct bkvoice_runtime_s *runtime = &g_runtime;
  struct bkvoice_turn_snapshot_s turn;
  irqstate_t flags;
  uint64_t now = bkvoice_now();

  response->flags |= BKVOICE_STATUS_TLS_AVAILABLE;
  if (runtime->config.initialized)
    {
      response->flags |= BKVOICE_STATUS_CONFIGURED;
    }

  if (runtime->session.connected)
    {
      response->flags |= BKVOICE_STATUS_CONNECTED;
      response->flags &= ~BKVOICE_STATUS_LOCAL_ONLY;
    }

  if (runtime->session.ready)
    {
      response->flags |= BKVOICE_STATUS_GATEWAY_READY;
    }

  flags = spin_lock_irqsave(&runtime->button_lock);
  if (runtime->button_link && runtime->button_sequence != 0 &&
      now >= runtime->button_received_ms &&
      now - runtime->button_received_ms < BKVOICE_BUTTON_LEASE_MS)
    {
      response->flags |= BKVOICE_STATUS_PTT_LINK;
    }

  spin_unlock_irqrestore(&runtime->button_lock, flags);
  if (runtime->cloud)
    {
      struct bkcloud_runtime_status_s cloud;
      bkcloud_runtime_status(runtime->cloud, &cloud);
      response->flags |= BKVOICE_STATUS_CLOUD_MODE;
      response->flags &= ~BKVOICE_STATUS_LOCAL_ONLY;
      if (cloud.ready) response->flags |= BKVOICE_STATUS_CLOUD_READY;
      if (cloud.busy) response->flags |= BKVOICE_STATUS_CLOUD_BUSY;
      if (cloud.pressed) response->flags |= BKVOICE_STATUS_PTT_PRESSED;
      response->result.live.turn_state = cloud.turn_state;
      response->result.live.last_error = cloud.last_error;
      return;
    }
  if (runtime->pressed)
    {
      response->flags |= BKVOICE_STATUS_PTT_PRESSED;
    }

  bkvoice_turn_snapshot(&runtime->ptt->turn, &turn);
  response->result.live.turn_state = turn.state;
  response->result.live.presses = runtime->presses;
  response->result.live.last_error = runtime->last_error;
  if (runtime->session.initialized)
    {
      struct bkvoice_gateway_snapshot_s gateway;
      bkvoice_gateway_snapshot(&runtime->session.gateway, &gateway);
      response->data_bytes = gateway.tx_frames;
      response->duration_ms = gateway.rx_frames;
    }
}

int bkvoice_runtime_initialize(struct bkvoice_ptt_s *ptt,
                               uint32_t boot_generation, sem_t *wake)
{
  struct bkvoice_runtime_s *runtime = &g_runtime;
  int ret;

  if (ptt == NULL || wake == NULL || boot_generation == 0)
    {
      return -EINVAL;
    }

