open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_runtime.c
  runtime->ptt = ptt;
  runtime->boot_generation = boot_generation;
  runtime->wake = wake;
#ifdef BKVOICE_RUNTIME_SOFT_OFF
  __atomic_store_n(&runtime->soft_off_pending, false, __ATOMIC_RELEASE);
  runtime->soft_off_accepted = false;
  runtime->soft_off_blockdev_held = false;
  runtime->soft_off_failure = 0;
  runtime->soft_off_status_ms = 0;
  __atomic_store_n(&runtime->soft_off_mutations, 0u, __ATOMIC_RELEASE);
#endif
#ifdef CONFIG_BK7258_VOICE_WAKE_RUNTIME
  runtime->wake_session = NULL;
  runtime->wake_result = 0;
  runtime->wake_attempted = false;
#endif
#ifdef CONFIG_BK7258_OTA_MANAGER
  memset(&runtime->firmware_version, 0, sizeof(runtime->firmware_version));
  memset(runtime->firmware_root_sha256, 0,
         sizeof(runtime->firmware_root_sha256));
  runtime->firmware_identity_valid =
    bk7258_active_ap_image_version(&runtime->firmware_version) == 0 &&
    bk7258_ota_catalog_public_fingerprint(
      runtime->firmware_root_sha256) == 0;
#endif
  ret = sem_init(&runtime->receiver_done, 0, 0);
  if (ret < 0)
    {
      return -errno;
    }

#ifdef BKVOICE_RUNTIME_OTA
  bkvoice_ota_clear(runtime);
  memset(&runtime->ota_direct_status, 0,
         sizeof(runtime->ota_direct_status));
  runtime->ota_direct_status_valid = false;
  memset(&runtime->ota_intent, 0, sizeof(runtime->ota_intent));
  runtime->ota_store_ready = false;
  runtime->ota_intent_present = false;
  runtime->ota_store_revision = 0;
  runtime->ota_restore_ms = 0;
  ret = sem_init(&runtime->ota_done, 0, 0);
  if (ret < 0)
    {
      ret = -errno;
      (void)sem_destroy(&runtime->receiver_done);
      return ret;
    }

  ret = sem_init(&runtime->ota_target_decision, 0, 0);
  if (ret < 0)
    {
      ret = -errno;
      (void)sem_destroy(&runtime->ota_done);
      (void)sem_destroy(&runtime->receiver_done);
      return ret;
    }
#endif

  ret = rpmsg_register_callback(runtime, bkvoice_button_device_created,
                                bkvoice_button_device_destroyed, NULL, NULL);
  if (ret < 0)
    {
#ifdef BKVOICE_RUNTIME_OTA
      (void)sem_destroy(&runtime->ota_target_decision);
      (void)sem_destroy(&runtime->ota_done);
#endif
      (void)sem_destroy(&runtime->receiver_done);
    }

  else
    {
      runtime->initialized = true;
    }

  return ret;
}

int bkvoice_runtime_uninitialize(void)
{
  struct bkvoice_runtime_s *runtime = &g_runtime;
  int ret;

  if (!runtime->initialized)
    {
      return 0;
    }

#ifdef BKVOICE_RUNTIME_SOFT_OFF
  if (bkvoice_soft_off_pending(runtime)) return -EBUSY;
#endif

#ifdef CONFIG_BK7258_PROVISION_GATT
  if (bkprov_owner_busy() || bkprov_network_busy() || runtime->identity_pending) return -EBUSY;
  (void)bkprov_owner_unbind();
  (void)bkprov_network_unbind();
  bkprov_identity_clear(&runtime->identity);
  runtime->identity_bound = false;
#endif

  ret = bkvoice_runtime_clear(runtime);
  if (ret < 0)
    {
      return ret;
    }

  rpmsg_unregister_callback(runtime, bkvoice_button_device_created,
                             bkvoice_button_device_destroyed, NULL, NULL);
  if (nxmutex_lock(&runtime->endpoint_lock) >= 0)
    {
      if (runtime->button_endpoint.rdev != NULL)
        {
          rpmsg_destroy_ept(&runtime->button_endpoint);
          memset(&runtime->button_endpoint, 0,
                 sizeof(runtime->button_endpoint));
        }

      nxmutex_unlock(&runtime->endpoint_lock);
    }

  (void)sem_destroy(&runtime->receiver_done);
#ifdef BKVOICE_RUNTIME_OTA
  (void)sem_destroy(&runtime->ota_target_decision);
  (void)sem_destroy(&runtime->ota_done);
#endif
  runtime->initialized = false;
  runtime->wake = NULL;
  runtime->ptt = NULL;
  return 0;
}
